{
  "0": {
    "id": "df1e3c26-a4b8-412a-bab3-da4af5edcb43_c0",
    "text": "Software Engineering Intern Bengaluru, Karnataka, India What is Visa? WE ARE NOT A BANK; WE ARE NOT A CREDIT CARD COMPANY!! Visa is the world's leader in digital payments technology! Visa's mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling over 259 billion payments transactions safely between consumers, merchants, financial institutions, and government entities in more than 200 countries and territories each year. The company's dedication to innovation drives the rapid growth of connected commerce on any device and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce",
    "metadata": {
      "file_id": "df1e3c26-a4b8-412a-bab3-da4af5edcb43",
      "chunk_index": 0
    }
  },
  "1": {
    "id": "df1e3c26-a4b8-412a-bab3-da4af5edcb43_c1",
    "text": "At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who help drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers. You're an Individual. We're the team for you. Together, let's transform the way the world pays. Behind the Visa brand are our talented employees who continuously raise the bar with innovative solutions and products that deliver the convenience and security of digital currency to more people all over the world. We are currently looking for candidates for our 2026 Summer Internship Program. Visa interns gain real-world experience working for one of the world's most recognized brands",
    "metadata": {
      "file_id": "df1e3c26-a4b8-412a-bab3-da4af5edcb43",
      "chunk_index": 1
    }
  },
  "2": {
    "id": "df1e3c26-a4b8-412a-bab3-da4af5edcb43_c2",
    "text": "Visa interns gain real-world experience working for one of the world's most recognized brands. During this intensive 10–12-week internship, you will work on challenging and rewarding assignments, gain exposure to Visa business leaders and executives, and participate in social and networking opportunities. This is a hybrid position. Expectation of days in office will be confirmed by your Hiring Manager. So, what are we looking for in a Software Engineering Intern? • HTML, CSS, JavaScript, Responsive Design, Accessibility, Objective C, and/or Android SDK • Training in C/C++ and Object-Oriented design is preferred • Familiarity with software development methodology that is used to structure, plan, and control the process of software development • Experience with user research and user centered design",
    "metadata": {
      "file_id": "df1e3c26-a4b8-412a-bab3-da4af5edcb43",
      "chunk_index": 2
    }
  },
  "3": {
    "id": "df1e3c26-a4b8-412a-bab3-da4af5edcb43_c3",
    "text": "• Experience with usability (e.g., as a tester, analyst, or developer using user-centered data) • Experience with accessibility (Section 508 and/or WCAG 2.0) a plus • Knowledge of user interface design as applied to Web-based applications and mobile devices. • Knowledge of both Macs and PCs helpful • Proficiency in MS Excel, Word and PowerPoint is required The skills below will help us differentiate you with your peer group: • Strong ability to collaborate • Highly motivated, resourceful and ability to work independently with initial guidance and direction • Teamwork, interpersonal & relationship-building skills, and ability to lead by influence and example • Project management skills and attention to detail • Strong written and oral communication, including large-group presentations • Proven ability to prioritize and manage multiple projects simultaneously",
    "metadata": {
      "file_id": "df1e3c26-a4b8-412a-bab3-da4af5edcb43",
      "chunk_index": 3
    }
  },
  "4": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c4",
    "text": "1. The Organization is based on the principle of the sovereign equality of all its Members. 2. All Members, in order to ensure to all of them the rights and benefits resulting from membership, shall fulfil in good faith the obligations assumed by them in accordance with the present Charter. 3. All Members shall settle their international disputes by peaceful means in such a manner that international peace and security, and justice, are not endangered. 4. All Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any state, or in any other manner inconsistent with the Purposes of the United Nations. 5. All Members shall give the United Nations every assistance in any action it takes in accordance with the present Charter, and shall refrain from giving assistance to any state against which the United Nations is taking preventive or enforcement action. 6",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 4
    }
  },
  "5": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c5",
    "text": "6. The Organization shall ensure that states which are not Members of the United Nations act in accordance with these Principles so far as may be necessary for the maintenance of international peace and security. 7. Nothing contained in the present Charter shall authorize the United Nations to intervene in matters which are essentially within the domestic jurisdiction of any state or shall require the Members to submit such matters to settlement under the present Charter; but this principle shall not prejudice the application of enforcement measures under Chapter VII. CHAPTER II MEMBERSHIP Article 3 The original Members of the United Nations shall be the states which, having participated in the United Nations Conference on International Organization at San Francisco, or having previously signed the Declaration by United Nations of January 1,1942, sign the present Charter and ratify it in accordance with Article 110. Article 4 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 5
    }
  },
  "6": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c6",
    "text": "Article 4 1. Membership in the United Nations is open to all other peace-loving states which accept the obligations contained in the present Charter and, in the judgment of the Organization, are able and willing to carry out these obligations. 2. The admission of any such state to membership in the United Nations will be effected by a decision of the General Assembly upon the recommendation of the Security Council. Article 5 / A Member of the United Nations against which preventive or enforcement action has been taken by the Security Council may be suspended from the exercise of the rights and privileges of membership by the General Assembly upon the recommendation of the Security Council. The exercise of these rights and privileges may be restored by the Security Council",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 6
    }
  },
  "7": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c7",
    "text": "The exercise of these rights and privileges may be restored by the Security Council. Article 6 A Member of the United Nations which has persistently violated the Principles contained in the present Charter may be expelled from the Organization by the General Assembly upon the recommendation of the Security Council. CHAPTER III ORGANS Article 7 1. There are established as the principal organs of the United Nations: a General Assembly, a Security Council, an Economic and Social Council, a Trusteeship Council, an International Court of Justice, and a Secretariat. 2. Such subsidiary organs as may be found necessary may be established in accordance with the present Charter. Article 8 The United Nations shall place no restrictions on the eligibility of men and women to participate in any capacity and under conditions of equality in-its principal and subsidiary organs. CHAPTER IV THE GENERAL ASSEMBLY Composition Article 9 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 7
    }
  },
  "8": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c8",
    "text": "CHAPTER IV THE GENERAL ASSEMBLY Composition Article 9 1. The General Assembly shall consist of all the Members of the United Nations. 2. Each Member shall have not more than five representatives in the General Assembly. Functions and Powers Article 10 The General Assembly may discuss any questions or any matters within the scope of the present Charter or relating to the powers and functions of any organs provided for in the present Charter, and, except as provided in Article 12, may make recommendations to the Members of the United Nations or to the Security Council or to both on any such questions or matters. Article 11 1. The General Assembly may consider the general principles of cooperation in the maintenance of international peace and security, including the principles governing disarmament and the regulation of armaments, and may make recommendations with regard to such principles to the Members or to the Security Council or to both. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 8
    }
  },
  "9": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c9",
    "text": "2. The General Assembly may discuss any questions relating to the maintenance of international peace and security brought before it by any Member of the United Nations, or by the Security Council, or by a state which is not a Member of the United Nations in accordance with Article 35, paragraph 2, and, except as provided in Article 12, may make recommendations with regard to any such questions to the state or states concerned or to the Security Council or to both. Any such question on which action is necessary shall be referred to the Security Council by the General Assembly either before or after discussion. 3. The General Assembly may call the attention of the Security Council to situations which are likely to endanger international peace and security. 4. The powers of the General Assembly set forth in this Article shall not limit the general scope of Article 10. Article 12 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 9
    }
  },
  "10": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c10",
    "text": "Article 12 1. While the Security Council is exercising in respect of any dispute or situation the functions assigned to it in the present Charter, the General Assembly shall not make any recommendation with regard to that dispute or situation unless the Security Council so requests. 2. The Secretary-General, with the consent of the Security Council, shall notify the General Assembly at each session of any matters relative to the maintenance of international peace and security which are being dealt with by the Security Council and shall similarly notify the General Assembly, or the Members of the United Nations if the General Assembly is not in session, immediately the Security Council ceases to deal with such matters. Article 13 1. The General Assembly shall initiate studies and make recommendations for the purpose of : a. promoting international cooperation in the political field and encouraging the progressive development of international law and its codification; b",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 10
    }
  },
  "11": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c11",
    "text": "promoting international cooperation in the economic, social, cultural, educational, and health fields, and assisting in the realization of human rights and fundamental freedoms for all without distinction as to race, sex, language, or religion. 2. The further responsibilities, functions, and powers of the General Assembly with respect to matters mentioned in paragraph l(b) above are set forth in Chapters IX and X. Article 14 Subject to the provisions of Article 12, the General Assembly may recommend measures for the peaceful adjustment of any situation, regardless of origin, which it deems likely to impair the general welfare or friendly relations among nations, including situations resulting from a violation of the provisions of the present Charter setting forth the Purposes and Principles of the United Nations. Article 15 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 11
    }
  },
  "12": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c12",
    "text": "Article 15 1. The General Assembly shall receive and consider annual and special reports from the Security Council; these reports shall include an account of the measures that the Security Council has decided upon or taken to maintain international peace and security. 2. The General Assembly shall receive and consider reports from the other organs of the United Nations. Article 16 The General Assembly shall perform such functions with respect to the international trusteeship system as are assigned to it under Chapters XII and XIII, including the approval of the trusteeship agreements for areas not designated as strategic. Article 17 1. The General Assembly shall consider and approve the budget of the Organization. 2. The expenses of the Organization shall be borne by the Members as apportioned by the General Assembly. 3",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 12
    }
  },
  "13": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c13",
    "text": "3. The General Assembly shall consider and approve any financial and budgetary arrangements with specialized agencies referred to in Article 57 and shall examine the administrative budgets of such specialized agencies with a view to making recommendations to the agencies concerned. Voting Article 18 1. Each member of the General Assembly shall have one vote. 2. Decisions of the General Assembly on important questions shall be made by a two-thirds majority of the members present and voting",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 13
    }
  },
  "14": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c14",
    "text": "These questions shall include: recommendations with respect to the maintenance of international peace and security, the election of the non-permanent members of the Security Council, the election of the members of the Economic and Social Council, the election of members of the Trusteeship Council in accordance with paragraph l(c) of Article 86, the admission of new Members to the United Nations, the suspension of the rights and privileges of membership, the expulsion of Members, questions relating to the operation of the trusteeship system, and budgetary questions. 3. Decisions on other questions, including the determination of additional categories of questions to be decided by a two-thirds majority, shall be made by a majority of the members present and voting",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 14
    }
  },
  "15": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c15",
    "text": "Article 19 A Member of the United Nations which is in arrears in the payment of its financial contributions to the Organization shall have no vote in the General Assembly if the amount of its arrears equals or exceeds the amount of the contributions due from it for the preceding two full years. The General Assembly may, nevertheless, permit such a Member to vote if it is satisfied that the failure to pay is due to conditions beyond the control of the Member. Procedure Article 20 The General Assembly shall meet in regular annual sessions and in such special sessions as occasion may require. Special sessions shall be convoked by the Secretary-General at the request of the Security Council or of a majority of the Members of the United Nations. Article 21 The General Assembly shall adopt its own rules of procedure. It shall elect its President for each session. Article 22 The General Assembly may establish such subsidiary organs as it deems necessary for the performance of its functions",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 15
    }
  },
  "16": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c16",
    "text": "CHAPTER V THE SECURITY COUNCIL Composition Article 23 1. The Security Council shall consist of eleven Members of the United Nations. The Republic of China, France, the Union of Soviet Socialist Republics, the United Kingdom of Great Britain and Northern Ireland, and the United States of America shall be permanent members of the Security Council. The General Assembly shall elect six other Members of the United Nations to be non-permanent members of the Security Council, due regard being specially paid, in the first instance to the contribution of Members of the United Nations to the maintenance of international peace and security and to the other purposes of the Organization, and also to equitable geographical distribution. 2. The non-permanent members of the Security Council shall be elected for a term of two years. In the first election of the non-permanent members, however, three shall be chosen for a term of one year",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 16
    }
  },
  "17": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c17",
    "text": "A retiring member shall not be eligible for immediate re-election. 3. Each member of the Security Council shall have one representative. Functions and Powers Article 24 1. In order to ensure prompt and effective action by the United Nations, its Members confer on the Security Council primary responsibility for the maintenance of international peace and security, and agree that in carrying out its duties under this responsibility the Security Council acts on their behalf. 2. In discharging these duties the Security Council shall act in accordance with the Purposes and Principles of the United Nations. The specific powers granted to the Security Council for the discharge of these duties are laid down in Chapters VI, VII, VIII, and XII. 3. The Security Council shall submit annual and, when necessary, special reports to the General Assembly for its consideration",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 17
    }
  },
  "18": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c18",
    "text": "Article 25 The Members of the United Nations agree to accept and carry out the decisions of the Security Council in accordance with the present Charter. Article 26 In order to promote the establishment and maintenance of international peace and security with the least diversion for armaments of the world's human and economic resources, the Security Council shall be responsible for formulating, with the assistance of the Military Staff Committee referred to in Article 47, plans to be submitted to the Members of the United Nations for the establishment of a system for the regulation \"of armaments. Voting Article 27 1. Each member of the Security Council shall have one vote. 2. Decisions of the Security Council on procedural matters shall be made by an affirmative vote of seven members. 3",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 18
    }
  },
  "19": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c19",
    "text": "3. Decisions of the Security Council on all other matters shall be made by an affirmative vote of seven members including the concurring votes of the permanent members ; provided that, in decisions under Chapter VI, and under paragraph 3 of Article 52, a party to a dispute shall abstain from voting. Procedure Article 1. The Security Council shall be so organized as to be able to function continuously. Each member of the Security Council shall for this purpose be represented at all times at the seat of the Organization. 2. The Security Council shall hold periodic meetings at which each of its members may, if it so desires, be represented by a member of the government or by some other specially designated representative. 3. The Security Council may hold meetings at such places other than the seat of the Organization as in its judgment will best facilitate its work",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 19
    }
  },
  "20": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c20",
    "text": "Article 29 The Security Council may establish such subsidiary organs as it deems necessary for the performance of its functions. Article 30 The Security Council shall adopt its own rules of procedure, including the method of selecting its President. Article 31 Any Member of the United Nations which is not a member of the Security Council may participate, without vote, in the discussion of any question brought before the Security Council whenever the latter considers that the interests of that Member are specially affected. Article 32 Any Member of the United Nations which is not a member of the Security Council or any state which is not a Member of the United Nations, if it is a party to a dispute under consideration by the Security Council, shall be invited to participate, without vote, in the discussion relating to the dispute. The Security Council shall lay down such conditions as it deems just for the participation, of a state which is not a Member of the United Nations",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 20
    }
  },
  "21": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c21",
    "text": "CHAPTER VI PACIFIC SETTLEMENT OF DISPUTES Article 33 1. The parties to any dispute, the continuance of which is likely to endanger the maintenance of international peace and security, shall, first of all, seek a solution by negotiation, enquiry, mediation, conciliation, arbitration, judicial settlement, resort to regional agencies or arrangements, or other peaceful means of their own choice. 2. The Security Council shall, when it deems necessary, call upon the parties to settle their dispute by such means. Article 34 The Security Council may investigate any dispute, or any situation which might lead to international friction or give rise to a dispute, in order to determine whether the continuance of the dispute or situation is likely to endanger the maintenance of international peace and security. Article 35 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 21
    }
  },
  "22": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c22",
    "text": "Article 35 1. Any Member of the United Nations may bring any dispute, or any situation of the nature referred to in Article 34, to the attention of the Security Council or of the General Assembly. 2. A state which is not a Member of the United Nations may bring to the attention of the Security Council or of the General Assembly any dispute to which it is a party if it accepts in advance, for the purposes of the dispute, the obligations of pacific settlement provided in the present Charter. 3. The proceedings of the General Assembly in respect of matters brought to its attention under this Article will be subject to the provisions of Articles 11 and 12. Article 36 1. The Security Council may, at any stage of a dispute of the nature referred to in Article 33 or of a situation of like nature, recommend appropriate procedures or methods of adjustment. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 22
    }
  },
  "23": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c23",
    "text": "2. The Security Council should take into consideration any procedures for the settlement of the dispute which have already been adopted by the parties. 3. In making recommendations under this Article the Security Council should also take into consideration that legal disputes should as a general rule be referred by the parties to the International Court of Justice in accordance with the provisions of the Statute of the Court. Article 37 1. Should the parties to a dispute of the nature referred to in Article 33 fail to settle it by the means indicated in that Article, they shall refer it to the Security Council. 8 2. If the Security Council deems that the continuance of the dispute is in fact likely to endanger the maintenance of international peace and security, it shall decide whether to take action under Article 36 or to recommend such terms of settlement as it may consider appropriate",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 23
    }
  },
  "24": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c24",
    "text": "Article 38 Without prejudice to the provisions of Articles 33 to 37, the Security Council may, if all the parties to any dispute so request, make recommendations to the parties with a view to a pacific settlement of the dispute. CHAPTER W ACTION WITH RESPECT TO THREATS TO THE PEACE, BREACHES OF THE PEACE, AND ACTS OF AGGRESSION Article 39 The Security Council shall determine the existence of any threat to the peace, breach of the peace, or act of aggression and shall make recommendations, or decide what measures shall be taken in accordance with Articles 41 and 42, to maintain or restore international peace and security. Article 40 In order to prevent an aggravation of the situation, the Security Council may, before making the recommendations or deciding upon the measures provided for in Article 39, call upon the parties concerned to comply with such provisional measures as it deems necessary or desirable",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 24
    }
  },
  "25": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c25",
    "text": "Such provisional measures shall be without prejudice to the rights, claims, or position of the parties concerned. The Security Council shall duly take account of failure to comply with such provisional measures. Article 41 The Security Council may decide what measures not involving the use of armed force are to be employed to give effect to its decisions, and it may call upon the Members of the United Nations to apply such measures. These may include complete or partial interruption of economic relations and of rail, sea, air, postal, telegraphic, radio, and other means of communication, and the severance of diplomatic relations. Article 42 Should the Security Council consider that measures provided for in Article 41 would be inadequate or have proved to be inadequate, it may take such action by air, sea, or land forces as may be necessary to maintain or restore international peace and security",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 25
    }
  },
  "26": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c26",
    "text": "Such action may include demonstrations, blockade, and other operations by air, sea, or land forces of Members of the United Nations. Article 43 1. All Members of the United Nations, in order to contribute to the maintenance of international peace and security, undertake to make available to the Security Council, on its call and in accordance with a special agreement or agreements, armed forces, assistance, and facilities, including rights of passage, necessary for the purpose of maintaining international peace and security. 2. Such agreement or agreements shall govern the numbers and types of forces, their degree of readiness and general location, and the nature of the facilities and assistance to be provided. 3. The agreement or agreements shall be negotiated as soon as possible on the initiative of the Security Council",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 26
    }
  },
  "27": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c27",
    "text": "They shall be concluded between the Security Council and Members or between the Security Council and groups of Members and shall be subject to ratification by the signatory states in accordance with their respective constitutional processes. Article 44 When the Security Council has decided to use force it shall, before calling upon a Member not represented on it to provide armed forces in fulfilhnent of the obligations assumed under Article 43, invite that Member, if the Member so desires, to participate in the decisions of the Security Council concerning the employment of contingents of that Member's armed forces. Article 45 In order to enable the United Nations to take urgent military measures, Members shall hold immediately available national air-force contingents for combined international enforcement action",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 27
    }
  },
  "28": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c28",
    "text": "The strength and degree of readiness of these contingents and plans for their combined action shall be determined, within the limits laid down in the special agreement or agreements referred to in Article 43, by the Security Council with the assistance of the Military Staff Committee. Article 46 Plans for the application of armed force shall be made by the Security Council with the assistance of the Military Staff Committee. Article 47 1. There shall be established a Military Staff Committee to advise and assist the Security Council on all questions relating to the Security Council's military requirements for the maintenance of international peace and security, the employment and command of forces placed at its disposal, the regulation of armaments, and possible disarmament. 2. The Military Staff Committee shall consist of the Chiefs of Staff of the permanent members of the Security Council or their representatives",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 28
    }
  },
  "29": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c29",
    "text": "Any Member of the United Nations not permanently represented on the Committee shall be invited by the Committee to be associated with it when the efficient discharge of the Committee's responsibilities requires the participation of that Member in its work. 3. The Military Staff Committee shall be responsible under the Security Council for the strategic direction of any armed forces placed at the disposal of the Security Council. Questions relating to the command of such forces shall be worked out subsequently. 4. The Military Staff Committee, with the authorization of the Security Council and after consultation with appropriate regional agencies, may establish regional subcommittees. Article 48 1. The action required to carry out the decisions of the Security Council for the maintenance of international peace and security shall be taken by all the Members of the United Nations or by some of them, as the Security Council may determine. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 29
    }
  },
  "30": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c30",
    "text": "2. Such decisions shall be carried out by the Members of the United Nations directly and through their action in the appropriate international agencies of which they are members. Article 49 The Members of the United Nations shall join in affording mutual assistance in carrying out the measures decided upon by the Security Council. Article 50 If preventive or enforcement measures against any state are taken by the Security Council, any other state, whether a Member of the United Nations or not, which finds itself confronted with special economic problems arising from the carrying out of those measures shall have the right to consult the Security Council with regard to a solution of those problems. Article 51 Nothing in the present Charter shall impair the inherent right of individual or collective selfdefense if an armed attack occurs against a Mem10 her of the United Nations, until the Security Council has taken the measures necessary to maintain international peace and security",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 30
    }
  },
  "31": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c31",
    "text": "Measures taken by Members in the exercise of this right of selfdefense shall be immediately reported to the Security Council and shall not in any way affect the authority and responsibility of the Security Council under the present Charter to take at any time such action as it deems necessary in order to maintain or restore international peace and security. CHAPTER VIII REGIONAL ARRANGEMENTS Article 52 1. Nothing in the present Charter precludes the existence of regional arrangements or agencies for dealing with such matters relating to the maintenance of international peace and security as are appropriate for regional action, provided that such arrangements or agencies and their activities are consistent with the Purposes and Principles of the United Nations. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 31
    }
  },
  "32": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c32",
    "text": "2. The Members of the United Nations entering into such arrangements or constituting such agencies shall make every effort to achieve pacific settlement of local disputes through such regional arrangements or by such regional agencies before referring them to the Security Council. 3. The Security Council shall encourage the development of pacific settlement of local disputes through such regional arrangements or by such regional agencies either on the initiative of the states concerned or by reference from the Security Council. 4. This Article in no way impairs the application of .Articles 34 and 35. Article 53 1. The Security Council shall, where appropriate, utilize such regional arrangements or agencies for enforcement action Under its authority",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 32
    }
  },
  "33": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c33",
    "text": "But no enforcement action shall be taken under regional arrangements or by regional agencies without the authorization of the Security Council * with the exception of measures against any enemy state, as defined in paragraph 2 of this Article, provided for pursuant to Article 107 or in regional arrangements directed against renewal of aggressive policy on the part of any such state, until such time as the Organization may, on request of the Governments concerned, be charged with the responsibility for preventing further aggression by such a state. 2. The term enemy state as used in paragraph 1 of this Article applies to any state which during the Second World War has been an enemy of any signatory of the present Charter. Article 54 The Security Council shall at all times be kept fully informed of activities undertaken or in contemplation under regional arrangements or by regional agencies for the maintenance of international peace and security",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 33
    }
  },
  "34": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c34",
    "text": "CHAPTER IX INTERNATIONAL ECONOMIC AND SOCIAL COOPERATION Article 55 With a view to the creation of conditions of stability and well-being which are necessary for peaceful and friendly relations among nations based on respect for the principle of equal rights and self-determination of peoples, the United Nations shall promote: a. higher standards of living, full employment, and conditions of economic and social progress and development; b. solutions of international economic, social, health, and related problems; and inter11 national cultural and educational cooperation; and c. universal respect for, and observance of, human rights and fundamental freedoms for all without distinction as to race, sex, language, or religion. Article 56 All Members pledge themselves to take joint and separate action in cooperation with the Organization for the achievement of the purposes set forth in Article 55. Article 57 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 34
    }
  },
  "35": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c35",
    "text": "Article 57 1. The various specialized agencies, established by intergovernmental agreement and having wide international responsibilities, as defined in their basic instruments, in economic, social, cultural, educational, health, and related fields, shall be brought into relationship with the United Nations in accordance with the provisions of Article 63. 2. Such agencies thus brought into relationship with the United Nations are hereinafter referred to as specialized agencies. Article 58 The Organization shall make recommendations for the coordination of the policies and activities of the specialized agencies. Article 59 The Organization shall, where appropriate, initiate negotiations among the states concerned for the creation of any new specialized agencies required for the accomplishment of the purposes set forth in Article 55",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 35
    }
  },
  "36": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c36",
    "text": "Article 60 Responsibility for the discharge of the functions of the Organization set forth in this Chapter shall be vested in the General Assembly and, under the authority of the General Assembly, in 12 the Economic and Social Council, which shall have for this purpose the powers set forth in Chapter X. CHAPTER X THE ECONOMIC AND SOCIAL COUNCIL Composition Article 61 1. The Economic and Social Council shall consist of eighteen Members of the United Nations elected by the General Assembly. 2. Subject to the provisions of paragraph 3, six members of the Economic and Social Council shall be elected each year for a term of three years. A retiring member shall be eligible for immediate re-election. 3. At the first election, eighteen members of the Economic and Social Council shall be chosen. The term of office of six members so chosen shall expire at the end of one year, and of six other members at the end of two years, in accordance with arrangements made by the General Assembly. 4",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 36
    }
  },
  "37": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c37",
    "text": "4. Each member of the Economic and Social Council shall have one representative. Functions and Powers Article 62 1. The Economic and Social Council may make or initiate studies and reports with respect to international economic, social, cultural, educational, health, and related matters and may make recommendations with respect to any such matters to the General Assembly, to the Members of the United Nations, and to the specialized agencies concerned. 2. It may make recommendations for the purpose of promoting respect for, and observance of, human rights and fundamental freedoms for all. 3. It may prepare draft conventions for submission to the General Assembly, with respect to matters falling within its competence. 4. It may call, in accordance with the rules prescribed by the United Nations, international conferences on matters falling within its competence. Article 63 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 37
    }
  },
  "38": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c38",
    "text": "Article 63 1. The Economic and Social Council may enter into agreements with any of the agencies referred to in Article 57, defining the terms on which the agency concerned shall be brought into relationship with the United Nations. Such agreements shall be subject to approval by the General Assembly. 2. It may coordinate the activities of the specialized agencies through consultation with and recommendations to such agencies and through recommendations to the General Assembly and to the Members of the United Nations. Article 64 1. The Economic and Social Council may take appropriate steps to obtain regular reports from the specialized agencies. It may make arrangements with the Members of the United Nations and with the specialized agencies to obtain reports on the steps taken to give effect to its own recommendations and to recommendations on matters falling within its competence made by the General Assembly. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 38
    }
  },
  "39": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c39",
    "text": "2. It may communicate its observations on these reports to the General Assembly. Article 65 The Economic and Social Council may furnish information to the Security Council and shall assist the Security Council upon its request. Article 66 1. The Economic and Social Council shall perform such functions as fall within its competence in connection with the carrying out of the recommendations of the General Assembly. 2. It may, with the approval of the General Assembly, perform services at the request of Members of the United Nations and at the request of specialized agencies. 3. It shall perform such other functions as are specified elsewhere in the present Charter or as may be assigned to it by the General Assembly. Voting Article 67 1. Each member of the Economic and Social Council shall have one vote. 2. Decisions of the Economic and Social Council shall be made by a majority of the members present and voting",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 39
    }
  },
  "40": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c40",
    "text": "Procedure Article 68 The Economic and Social Council shall set up commissions in economic and social fields and for the promotion of human rights, and such other commissions as may be required for the performance of its functions. Article 69 The Economic and Social Council shall invite any Member of the United Nations to participate, without vote, in its deliberations on any matter of particular concern to that Member. Article 70 The Economic and Social Council may make arrangements for representatives of the specialized agencies to participate, without vote, in its deliberations and in those of the commissions established by it, and for its representatives to participate in the deliberations of the specialized agencies. Article 71 The Economic and Social Council may make suitable arrangements for consultation with nongovernmental organizations which are concerned with matters within its competence",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 40
    }
  },
  "41": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c41",
    "text": "Such arrange13 ments may be made with international organizations and, where appropriate, with national organizations after consultation with the Member of the United Nations concerned. Article 72 1. The Economic and Social Council shall adopt its own rules of procedure, including the method of selecting its President. 2. The Economic and Social Council shall meet as required in accordance with its rules, which shall include provision for the convening of meetings on the request of a majority of its members",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 41
    }
  },
  "42": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c42",
    "text": "CHAPTER XI DECLARATION REGARDING NON-SELF-GOVERNING TERRITORIES Article 73 Members of the United Nations which have or assume responsibilities for the administration of territories whose peoples have not yet attained a full measure of self-government recognize the principle that the interests of the inhabitants of these territories are paramount, and accept as a sacred trust the obligation to promote to the utmost, within the system of international peace and security established by the present Charter, the well-being of the inhabitants of these territories, and, to this end: a. to ensure, with due respect for the culture of the peoples concerned, their political, economic, social, and educational advancement, their just treatment, and their protection against abuses; b",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 42
    }
  },
  "43": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c43",
    "text": "to develop self-government, to take due account of the political aspirations of the peoples, and to assist them in the progressive development of their free political institutions, according to the particular circumstances of each territory and its peoples and their varying i stages of advancement; c. to further international peace and security; d. to promote constructive measures of development, to encourage research, and to cooperate with one another and, when and where appropriate, with specialized international bodies with a view to the practical achievement of the social, economic, and scientific purposes set forth in this Article; and e",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 43
    }
  },
  "44": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c44",
    "text": "to transmit regularly to the SecretaryGeneral for information purposes, subject to such limitation as security and constitutional considerations may require, statistical and other information of a technical nature relating to economic, social, and educational conditions in the territories for which they are respectively responsible other than those territories to which Chapters XII and XIII apply. Article 74 Members of the United Nations also agree that their policy in respect of the territories to which this Chapter applies, no less than in respect of their metropolitan areas, must be based on the general principle of good-neighborliness, due account being taken of the interests and well-being of the rest of the world, in social, economic, and commercial matters",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 44
    }
  },
  "45": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c45",
    "text": "CHAPTER XII INTERNATIONAL TRUSTEESHIP SYSTEM Article 75 The United Nations shall establish under its authority an international trusteeship system for the administration and supervision of such territories as may be placed thereunder by subsequent individual agreements. These territories are hereinafter referred to as trust territories. Article 76 The basic objectives of the trusteeship system, 14 in accordance with the Purposes of the United Nations laid down in Article 1 of the present Charter, shall be: a. to further international peace and security; b. to promote the political, economic, social, and educational advancement of the inhabitants of the trust territories, and their progressive development towards self-government or independence as may be appropriate to the particular circumstances of each territory and its peoples and the freely expressed wishes of the peoples concerned, and as may be provided by the terms of each trusteeship agreement; c",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 45
    }
  },
  "46": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c46",
    "text": "to encourage respect for human rights and for fundamental freedoms for all without distinction as to race, sex, language, or religion, and to encourage recognition of the interdependence of the peoples of the world; and d. to ensure equal treatment in social, economic, and commercial matters for all Members of the United Nations and their nationals, and also equal treatment for the latter in the administration of justice, without prejudice to the attainment of the foregoing objectives and subject to the provisions of Article 80. Article 77 1. The trusteeship system shall apply to such territories in the following categories as may be placed thereunder by means of trusteeship agreements: a. territories now held under mandate; b. territories which may be detached from enemy states as a result of the Second World War; and c. territories voluntarily placed under the system by states responsible for their administration. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 46
    }
  },
  "47": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c47",
    "text": "territories voluntarily placed under the system by states responsible for their administration. 2. It will be a matter for subsequent agreement as to which territories in the foregoing categories will be brought under the trusteeship system and upon what terms. Article 78 The trusteeship system shall not apply to territories which have become Members of the United Nations, relationship among which shall be based on respect for the principle of sovereign equality. Article 79 The terms of trusteeship for each territory to be placed under the trusteeship system, including any alteration or amendment, shall be agreed upon by the states directly concerned, including the mandatory power in the case of territories held under mandate by a Member of the United Nations, and shall be approved as provided for in Articles 83 and 85. Article 80 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 47
    }
  },
  "48": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c48",
    "text": "Article 80 1. Except as may be agreed upon in individual trusteeship agreements, made under Articles 77, 79, and 81, placing each territory under the trusteeship system, and until such agreements have been concluded, nothing in this Chapter shall be construed in or of itself to alter in any manner the rights whatsoever of any states or any peoples or the terms of existing international instruments to which Members of the United Nations may respectively be parties. 2. Paragraph 1 of this Article shall not be interpreted as giving grounds for delay or postponement of the negotiation and conclusion of agreements for placing mandated and other territories under the trusteeship system as provided for in Article 77. Article 81 The trusteeship agreement shall in each case include the terms under which the trust territory will be administered and designate the authority which will exercise the administration of the trust territory",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 48
    }
  },
  "49": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c49",
    "text": "Such authority, hereinafter called the 15 administering authority, may be one or more states or the Organization itself. Article 82 , There may be designated, in any trusteeship agreement, a strategic area or areas which may include part or all of the trust territory to which the agreement applies, without prejudice to any special agreement or agreements made under Article 43. Article 83 1. All functions of the United Nations relating to strategic areas, including the approval of the terms of the trusteeship agreements and of their alteration or amendment, shall be exercised by the Security Council. 2. The basic objectives set forth in Article 76 shall be applicable to the people of each strategic area. 3",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 49
    }
  },
  "50": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c50",
    "text": "3. The Security Council shall, subject to the provisions of the trusteeship agreements and without prejudice to security considerations, avail itself of the assistance of the Trusteeship Council to perform those functions of the United Nations under the trusteeship system relating to political, economic, social, and educational matters in the strategic areas. Article 84 It shall be the duty of the administering authority to ensure that the trust territory shall play its part in the maintenance of international peace and security. To this end the administering authority may make use of volunteer forces, facilities, and assistance from the trust territory in carrying out the obligations towards the Security Council undertaken in this regard by the administering authority, as well as for local defense and the maintenance of law and order within the trust territory. Article 85 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 50
    }
  },
  "51": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c51",
    "text": "Article 85 1. The functions of the United Nations with regard to trusteeship agreements for all areas not designated as strategic, including the approval of the terms of the trusteeship agreements and of their alteration or amendment, shall be exercised by the General Assembly. 2. The Trusteeship Council, operating under the authority of the General Assembly, shall assist the General Assembly in carrying out these functions. CHAPTER XIII THE TRUSTEESHIP COUNCIL Composition Article 86 1. The Trusteeship Council shall consist of the following Members of the United Nations: a. those Members administering trust territories; b. such of those Members mentioned by name in Article 23 as are not administering trust territories; and c",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 51
    }
  },
  "52": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c52",
    "text": "as many other Members elected for threeyear terms by the General Assembly as may be necessary to ensure that the total number of members of the Trusteeship Council is equally divided between those Members of the United Nations which administer trust territories and those which do not. 2. Each member of the Trusteeship Council shall designate one specially qualified person to represent it therein. Functions and Powers Article 87 The General Assembly and, under its authority, the Trusteeship Council, in carrying out their functions, may: a. consider reports submitted by the administering authority; 16 b. accept petitions and examine them in consultation with the administering authority; c. provide for periodic visits to the respective trust territories at times agreed upon with the administering authority; and d. take these and other actions in conformity with the terms of the trusteeship agreements",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 52
    }
  },
  "53": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c53",
    "text": "take these and other actions in conformity with the terms of the trusteeship agreements. Article 88 The Trusteeship Council shall formulate a questionnaire on the political, economic, social, and educational advancement of the inhabitants of each trust territory, and the administering authority for each trust territory within the competence of the General Assembly shall make an annual report to the General Assembly upon the basis of such questionnaire. Voting Article 89 1. Each member of the Trusteeship Council shall have one vote. 2. Decisions of the Trusteeship Council shall be made by a majority of the members present and voting. Procedure Article 90 1. The Trusteeship Council shall adopt its own rules of procedure, including the method of selecting its President. 2. The Trusteeship Council shall meet as required in accordance with its rules, which shall include provision for the convening of meetings on the request of a majority of its members",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 53
    }
  },
  "54": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c54",
    "text": "Article 91 The Trusteeship Council shall, when appropriate, avail itself of the assistance of the Economic and Social Council and of the specialized agencies in regard to matters with which they are respectively concerned. CHAPTER XIV THE INTERNATIONAL COURT OF JUSTICE Article 92 The International Court of Justice shall be the principal judicial organ of the United Nations. It shall function in accordance with the annexed Statute, which is based upon the Statute of the Permanent Court of International Justice and forms an integral part of the present Charter. Article 93 1. All Members of the United Nations are ipso facto parties to the Statute of the International Court of Justice. 2. A state which is not a Member of the United Nations may become a party to the Statute of the International Court of Justice on conditions to be determined in each case by the General Assembly upon the recommendation of the Security Council. Article 94 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 54
    }
  },
  "55": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c55",
    "text": "Article 94 1. Each Member of the United Nations undertakes to comply with the decision of the International Court of Justice in any case to which it is a party. 2. If any party to a case fails to perform the obligations incumbent upon it under a judgment rendered by the Court, the other party may have recourse to the Security Council, which may, if it deems necessary, make recommendations or decide upon measures to be taken to give effect to the judgment. Article 95 Nothing in the present Charter shall prevent Members of the United Nations from entrusting the solution of their differences to other tribunals by virtue of agreements already in existence or which may be concluded in the future. 17 Article 96 1. The General Assembly or the Security Council may request the International Court of Justice to give an advisory opinion on any legal question. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 55
    }
  },
  "56": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c56",
    "text": "2. Other organs of the United Nations and specialized agencies, which may at any time be so authorized by the General Assembly, may also request advisory opinions of the Court on legal questions arising within the scope of their activities. CHAPTER XV THE SECRETARIAT Article 97 The Secretariat shall comprise a SecretaryGeneral and such staff as the Organization may require. The Secretary-General shall be appointed by the General Assembly upon the recommendation of the Security Council. He shall be the chief administrative officer of the Organization. Article 98 The Secretary-General shall act in that capacity in all meetings of the General Assembly, of the Security Council, of the Economic and Social Council, and of the Trusteeship Council, and shall perform such other functions as are entrusted to him by these organs. The Secretary-General shall make an annual report to the General Assembly on the work of the Organization",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 56
    }
  },
  "57": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c57",
    "text": "Article 99 The Secretary-General may bring to the attention of the Security Council any matter which in his opinion may threaten the maintenance of international peace and security. Article 100 1. In the performance of their duties the Secre18 tary-General and the staff shall not seek or receive instructions from any government or from any other authority external to the Organization. They shall refrain from any action which might reflect on their position as international officials responsible only to the Organization. 2. Each Member of the United Nations undertakes to respect the exclusively international character of the responsibilities of the SecretaryGeneral and the staff and not to seek to influence them in the discharge of their responsibilities. Article 101 1. The staff shall be appointed by the Secretary-General under regulations established by the General Assembly. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 57
    }
  },
  "58": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c58",
    "text": "2. Appropriate staffs shall be permanently assigned to the Economic and Social Council, the Trusteeship Council, and, as required, to other organs of the United Nations. These staffs shall form a part of the Secretariat. 3. The paramount consideration in the employment of the staff and in the determination of the conditions of service shall be the necessity of securing the highest standards of efficiency, competence, and integrity. Due regard shall be paid to the importance of recruiting the staff on as wide a geographical basis as possible. CHAPTER XVI MISCELLANEOUS PROVISIONS Article 102 1. Every treaty and every international agreement entered into by any Member of the United Nations after the present Charter comes into force shall as soon as possible be registered with the Secretariat and published by it. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 58
    }
  },
  "59": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c59",
    "text": "2. No party to any such treaty or international agreement which has not been registered in accordance with the provisions of paragraph 1 of this Article may invoke that treaty or agreement before any organ of the United Nations. Article 103 In the event of a conflict between the obligations of the Members of the United Nations under the present Charter and their obligations under any other international agreement, their obligations under the present Charter shall prevail. Article 104 The Organization shall enjoy in the territory of each of its Members such legal capacity as may be necessary for the exercise of its functions and the fulfillment of its purposes. Article 105 1. The Organization shall enjoy in the territory of each of its Members such privileges and immunities as are necessary for the fulfillment of its purposes. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 59
    }
  },
  "60": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c60",
    "text": "2. Representatives of the Members of the United Nations and officials of the Organization shall similarly enjoy such privileges and immunities as are necessary for the independent exercise of their functions in connection with the Organization. 3. The General Assembly may make recommendations with a view to determining the details of the application of paragraphs 1 and 2 of this Airticle or may propose conventions to the Members of the United Nations for this purpose",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 60
    }
  },
  "61": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c61",
    "text": "CHAPTER XVH TRANSITIONAL SECURITY ARRANGEMENTS Article 106 Pending the coming into force of such special agreements referred to in Article 43 as in the opinion of the Security Council enable it to begin the exercise of its responsibilities under Article 42, the parties to the Four-Nation Declaration, signed at Moscow, October 30,1943, and France, shall, in accordance with the provisions of paragraph 5 of that Declaration, consult with one another and as occasion requires with other Members of the United Nations with a view to such joint action on behalf of the Organization as may be necessary for the purpose of maintaining international peace and security. Article 107 Nothing in the present Charter shall invalidate or preclude action, in relation to any state which during the Second World War has been an enemy of any signatory to the present Charter, taken or authorized as a result of that war by the Governments having responsibility for such action",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 61
    }
  },
  "62": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c62",
    "text": "CHAPTER XVIII AMENDMENTS Article 108 Amendments to the present Charter shall come into force for all Members of the United Nations when they have been adopted by a vote of two thirds of the members of the General Assembly and ratified in accordance with their respective constitutional processes by two thirds of the Members of the United Nations, including all the permanent members of the Security Council. Article 109 1. A General Conference of the Members of the United Nations for the purpose of reviewing the present Charter may be held at a date and place to be fixed by a two-thirds vote of the members of the General Assembly and by a vote of any seven members of the Security Council. Each Member of the United Nations shall have one vote in the conference. 19 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 62
    }
  },
  "63": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c63",
    "text": "Each Member of the United Nations shall have one vote in the conference. 19 2. Any alteration of the present Charter recommended by a two-thirds vote of the conference shall take effect when ratified in accordance with their respective constitutional processes by two thirds of the Members of the United Nations including all the permanent members of the Security Council. 3. If such a conference has not been held before the tenth annual session of the General Assembly following the coming into force of the present Charter, the proposal to call such a conference shall be placed on the agenda of that session of the General Assembly, and the conference shall be held if so decided by a majority vote of the members of the General Assembly and by a vote of any seven members of the Security Council. CHAPTER XIX RATIFICATION AND SIGNATURE Article 110 1. The present Charter shall be ratified by the signatory states in accordance with their respective constitutional processes. / 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 63
    }
  },
  "64": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c64",
    "text": "/ 2. The ratifications shall be deposited with the Government of the United States of America, which shall notify all the signatory states of each deposit as well as the Secretary-General of the Organization when he has been appointed. 3. The present Charter shall come into force upon the deposit of ratifications by the Republic of China, France, the Union of Soviet Socialist Republics, the United Kingdom of Great Britain and Northern Ireland, and the United States of America, and by a majority of the other signatory states. A protocol of the ratifications deposited shall thereupon be drawn up by the Government of the United States of America which shall communicate copies thereof to all the signatory states. 4. The states signatory to the present Charter which ratify it after it has come into force will become original Members of the United Nations on the date of the deposit of their respective ratifications",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 64
    }
  },
  "65": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c65",
    "text": "Article HI The present Charter, of which the Chinese, French, Russian, English, and Spanish texts are equally authentic, shall remain deposited in the archives of the Government of the United States of America. Duly certified copies thereof shall be transmitted by that Government to the Governments of the other signatory states. IN FAITH WHEREOF the representatives of the Governments of the United Nations have signed the present Charter. DONE at the city of San Francisco the twentysixth day of June, one thousand nine hundred and forty-five. 20 STATUTE OF THE INTERNATIONAL COURT OF JUSTICE Article 1 INTERNATIONAL COURT OF JUSTICE established by the Charter of the United Nations as the principal judicial organ of the United Nations shall be constituted and shall function in accordance with the provisions of the present Statute",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 65
    }
  },
  "66": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c66",
    "text": "CHAPTER I ORGANIZATION OF THE COURT Article 2 The Court shall be composed of a body of independent judges, elected regardless of their nationality from among persons of high moral character, who possess the qualifications required in their respective countries for appointment to the highest judicial offices, or are jurisconsults of recognized competence in international law. Article 3 1. The Court shall consist of fifteen members, no two of whom may be nationals of the same state. 2, A person who for the purposes of membership in the Court could be regarded as a national of more than one state shall be deemed to be a national of the one in which he ordinarily exercises civil and political rights. Article 4 1. The members of the Court shall be elected by the General Assembly and by the Security Council from a list of persons nominated by the national groups in the Permanent Court of Arbitration, in accordance with the following provisions. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 66
    }
  },
  "67": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c67",
    "text": "2. In the case of Members of the United Nations not represented in the Permanent Court of Arbitration, candidates shall be nominated by national groups appointed for this purpose by their governments under the same conditions as those prescribed for members of the Permanent Courkof Arbitration by Article 44 of the Convention of The Hague of 1907 for the pacific settlement of international disputes. 3. The conditions under which a state which is a party to the present Statute but is not a Member of the United Nations may participate in electing the members of the Court shall, in the absence of a special agreement, be laid down by the General Assembly upon recommendation of the Security Council. Article 5 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 67
    }
  },
  "68": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c68",
    "text": "Article 5 1. At least three months before the date of the election, the Secretary-General of the United Nations shall address a written request to the members of the Permanent Court of Arbitration belonging to the states which are parties to the present Statute, and to the members of the national groups appointed under Article 4, paragraph 2, inviting them to undertake, within a given time, by national groups, the nomination of persons in a position to accept the duties of a member of the Court. 2. No group may nominate more than four persons, not more than two of whom shall be of their own nationality. In no case may the number of candidates nominated by a group be more than double the number of seats to be filled. Article 6 Before making these nominations, each national group is recommended to consult its highest court of justice, its legal faculties and schools of law, and its national academies and national sections of international academies devoted to the study of law",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 68
    }
  },
  "69": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c69",
    "text": "Article 7 1. The Secretary-General shall prepare a list 21 in alphabetical order of all the persons thus nominated. Save as provided in Article 12, paragraph 2, these shall be the only persons eligible. 2. The Secretary-General shall submit this list to the General Assembly and to the Security Council. Article 8 The General Assembly and the Security Council shall proceed independently of one another to elect the members of the Court. Article 9 At every election, the electors shall bear in mind not only that the persons to be elected should individually possess the qualifications required, but also that in the body as a whole the representation of the main forms of civilization and of the principal legal systems of the world should be assured. Article 10 1. Those candidates who obtain an absolute majority of votes in the General Assembly and in the Security Council shall be considered as elected. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 69
    }
  },
  "70": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c70",
    "text": "2. Any vote of the Security Council, whether for the election of judges or for the appointment of members of the conference envisaged in Article 12, shall be taken without any distinction between permanent and non-permanent members of the Security Council. 3. In the event of more than one national of the same state obtaining an absolute majority of the votes both of the General Assembly and of the Security Council, the eldest of these only shall be considered as elected. Article 11 If, after the first meeting held for the purpose of the election, one or more seats remain to be filled, a second and, if necessary, a third meeting shall take place. Article 12 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 70
    }
  },
  "71": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c71",
    "text": "Article 12 1. If, after the third meeting, one or more seats still remain unfilled, a joint conference consisting of six members, three appointed by the General Assembly and three by the Security Council, may be formed at any time at the request of either the General Assembly or the Security Council, for the purpose of choosing by the vote of an absolute majority one name for each seat still vacant, to submit to the General Assembly and the Security Council for their respective acceptance. 2. If the joint conference is unanimously agreed upon any person who fulfils the required conditions, he maybe included in its list, even though he was not included in the list of nominations referred to in Article 7. 3",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 71
    }
  },
  "72": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c72",
    "text": "3. If the joint conference is satisfied that it will not be successful in procuring an election, those members of the Court who have already been elected shall, within a period to be fixed by the Security Council, proceed to fill the vacant seats by selection from among those candidates who have obtained votes either in the General Assembly or in the Security Council. 4. In the event of an equality of votes among the judges, the eldest judge shall have a casting vote. Article 13 1. The members of the Court shall be elected for nine years and may be re-elected; provided, however, that of the judges elected at the first election, the terms of five judges shall expire at the end of three years and the terms of five more judges shall expire at the end of six years. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 72
    }
  },
  "73": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c73",
    "text": "2. The judges whose terms are to expire at the end of the above-mentioned initial periods of three and six years shall be chosen by lot to be drawn by the Secretary-General immediately after the first election has been completed. 3. The members of the Court shall continue to 22 discharge their duties until their places have been filled. Though replaced, they shall finish any cases which they may have begun. 4. In the case of the resignation of a member of the Court, the resignation shall be addressed to the President of the Court for transmission to the Secretary-General. This last notification makes the place vacant. Article 14 Vacancies shall be filled by the same method as that laid down for the first election, subject to the following provision : the Secretary-General shall, within one month of the occurrence of the vacancy, proceed to issue the invitations provided for in Article 5, and the date of the election shall be fixed by the Security Council",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 73
    }
  },
  "74": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c74",
    "text": "Article 15 A member of the Court elected to replace a member whose term of office has not expired shall hold office for the remainder of his predecessor's term. Article 16 1. No member of the Court may exercise any political or administrative function, or engage in any other occupation of a professional nature. 2. Any doubt on this point shall be settled by the decision of the Court. Article 17 1. No member of the Court may act as agent, counsel, or advocate in any case. 2. No member may participate in the decision of any case in which he has previously taken part as agent, counsel, or advocate for one of the parties, or as a member of a national or international court, or of a commission of enquiry, or in any other capacity. 3. Any doubt on this point shall be settled by the decision of the Court. Article 18 1. No member of the Court can be dismissed unless, in the unanimous opinion of the other members, he has ceased to fulfil the required conditions. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 74
    }
  },
  "75": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c75",
    "text": "2. Formal notification thereof shall be made to the Secretary-General by the Registrar. 3. This notification makes the place vacant. Article 19 The members of the Court, when engaged on the business of the Court, shall enjoy diplomatic privileges and immunities. Article 20 Every member of the Court shall, before taking up his duties, make a solemn declaration in open court that he will exercise his powers impartially and conscientiously. Article 21 1. The Court shall elect its President and VicePresident for three years; they may be re-elected. 2. The Court shall appoint its Registrar and may provide for the appointment of such other officers as may be necessary. Article 22 1. The seat of the Court shall be established at The Hague. This, however, shall not prevent the Court from sitting and exercising its functions elsewhere whenever the Court considers it desirable. 2. The President and the Registrar shall reside at the seat of the Court. Article 23 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 75
    }
  },
  "76": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c76",
    "text": "2. The President and the Registrar shall reside at the seat of the Court. Article 23 1. The Court shall remain permanently in session, except during the judicial vacations, the dates and duration of which shall be fixed by the Court. 2. Members of the Court are entitled to peri23 odic leave, the dates and duration of which shall be fixed by the Court, having in mind the distance between The Hague and the home of each judge. 3. Members of the Court shall be bound, unless they are on leave or prevented from attending \" by illness or other serious reasons duly explained to the President, to hold themselves permanently at the disposal of the Court. Article 24 1. If, for some special reason, a member of the Court considers that he should not take part in the decision of a particular case, he shall so inform the President. 2. If the President considers that for some special reason one of the members of the Court should not sit in a particular case, he shall give him notice accordingly. 3",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 76
    }
  },
  "77": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c77",
    "text": "3. If in any such case the member of the Court and the President disagree, the matter shall be settled by the decision of the Court. Article 25 1. The full Court shall sit except when it is expressly provided otherwise in the present Statute. 2. Subject to the condition that the number of judges available to constitute the Court is not thereby reduced below eleven, the Rules of the Court may provide for allowing one or more judges, according to circumstances and in rotation, to be dispensed from sitting. 3. A quorum of nine judges shall suffice to constitute the Court. Article 26 1. The Court may from time to time form one or more chambers, composed of three or more judges as the Court may determine, for dealing with particular categories of cases; for example, labor cases and cases relating to transit and communications. 2. The Court may at any time form a chamber for dealing with a particular case",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 77
    }
  },
  "78": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c78",
    "text": "2. The Court may at any time form a chamber for dealing with a particular case. The number of judges to constitute such a chamber shall be determined by the Court with the approval of the parties. 3. Cases shall be heard and determined by the chambers provided for in this Article if the parties so request. Article 27 A judgment given by any of the chambers provided for in Articles 26 and 29 shall be considered as rendered by the Court. Article 28 The chambers provided for in Articles 26 and 29 may, with the consent of the parties, sit and exercise their functions elsewhere than at The Hague. Article 29 With a view to the speedy despatch of business, the Court shall form annually a chamber composed of five judges which, at the request of the parties, may hear and determine cases by summary procedure. In addition, two judges shall be selected for the purpose of replacing judges who find it impossible to sit. Article 30 1. The Court shall frame rules for carrying ou t its functions",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 78
    }
  },
  "79": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c79",
    "text": "Article 30 1. The Court shall frame rules for carrying ou t its functions. In particular, it shall lay down rules of procedure. 2. The Rules of the Court may provide for assessors to sit with the Court or with any of its chambers, without the right to vote. Article 31 1. Judges of the nationality of each of the parties shall retain their right to sit in the case before the Court. 2. If the Court includes upon the Bench a judge of the nationality of one of the parties, any other party may choose a person to sit as judge. Such person shall be chosen preferably from among 24 those persons who have been nominated as candidates as provided in Articles 4 and 5. 3. If the Court includes upon the Bench no judge of the nationality of the parties, each of these parties may proceed to choose a judge as provided in paragraph 2 of this Article. 4. The provisions of this Article shall apply to the case of Articles 26 and 29",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 79
    }
  },
  "80": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c80",
    "text": "4. The provisions of this Article shall apply to the case of Articles 26 and 29. In such cases, the President shall request one or, if necessary, two of the members of the Court forming the chamber to give place to the members of the Court of the nationality of the parties concerned, and, failing such, or if they are unable to be present, to the judges specially chosen by the parties. 5. Should there be several parties in the same interest, they shall, for the purpose of the preceding provisions, be reckoned as one party only. Any doubt upon this point shall be settled by the decision of the Court. 6. Judges chosen as laid down in paragraphs 2,3, and 4 of this Article shall fulfil the conditions required by Articles 2,17 (paragraph 2), 20, and 24 of the present Statute. They shall take part in the decision on terms of complete equality with their colleagues. Article 32 1. Each member of the Court shall receive an annual salary. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 80
    }
  },
  "81": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c81",
    "text": "Article 32 1. Each member of the Court shall receive an annual salary. 2. The President shall receive a special annual allowance. 3. The Vice-President shall receive a special allowance for every day on which he acts as President. 4. The judges chosen under Article 31, other than members of the Court, shall receive compensation for each^day on which they exercise their functions. 5. These salaries, allowances, and compensation shall be fixed by the General Assembly. They may not be decreased during the term of office. 6. The salary of the Registrar shall be fixed by the General Assembly on the proposal of the Court. 7. Regulations made by the General Assembly shall fix the conditions under which retirement pensions may be given to members of the Court and to the Registrar, and the conditions under which members of the Court and the Registrar shall have their traveling expenses refunded. 8. The above salaries, allowances, and compensation shall be free of all taxation",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 81
    }
  },
  "82": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c82",
    "text": "8. The above salaries, allowances, and compensation shall be free of all taxation. Article 33 The expenses of the Court shall be borne by the United Nations in such a manner as shall be decided by the General Assembly. CHAPTER II COMPETENCE OF THE COURT Article 34 1. Only states may be parties in cases before the Court. 2. The Court, subject to and in conformity with its Rules, may request of public international organizations information relevant to cases before it, and shall receive such information presented by such organizations on their own initiative. 3. Whenever the construction of the constituent instrument of a public international organization or of an international convention adopted thereunder is in question in a case before the Court, the Registrar shall so notify the public international organization concerned and shall communicate to it copies of all the written proceedings. Article 35 1. The Court shall be open to the states parties to the present Statute. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 82
    }
  },
  "83": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c83",
    "text": "Article 35 1. The Court shall be open to the states parties to the present Statute. 2. The conditions under which the Court shall be open to other states shall, subject to the special provisions contained in treaties in force, be laid 25 down by the Security Council, but in no case shall such conditions place the parties in a position of inequality before the Court. 3. When a state which is not a Member of the United Nations is a party to a case, the Court shall fix the amount which that party is to contribute towards the expenses of the Court. This provision shall not apply if such state is bearing a share of the expenses of the Court. Article 36 1. The jurisdiction of the Court comprises all cases which the parties refer to it and all matters specially provided for in the Charter of the United Nations or in treaties and conventions in force. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 83
    }
  },
  "84": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c84",
    "text": "2. The states parties to the present Statute may at any time declare that they recognize as compulsory ipso facto and without special agreement, in relation to any other state accepting the same obligation, the jurisdiction of the Court in all legal disputes concerning: a. the interpretation of a treaty; b. any question of international law; c. the existence of any fact which, if established, would constitute a breach of an international obligation ; d. the nature or extent of the reparation to be made for the breach of an international obligation. 3. The declarations referred to above may be made unconditionally or on condition of reciprocity on the part of several or certain states, or for a certain time. 4. Such declarations shall be deposited with the Secretary-General of the United Nations, who shall transmit copies thereof to the parties to the Statute and to the Registrar of the Court. 5",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 84
    }
  },
  "85": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c85",
    "text": "5. Declarations made under Article 36 of the Statute of the Permanent Court of International Justice and which are still in force shall be deemed, as between the parties to the present Statute, to be acceptances of the compulsory jurisdiction of the International Court of Justice for the period which they still have to run and in accordance with their terms. 6. In the event of a dispute as to whether the Court has jurisdiction, the matter shall be settled by the decision of the Court. Article 37 Whenever a treaty or convention in force provides for reference of a matter to a tribunal to have been instituted by the League of Nations, or to the Permanent Court of International Justice, the matter shall, as between the parties to the present Statute, be referred to the International Court of Justice. Article 38 1. The Court, whose function is to decide in accordance with international law such disputes as are submitted to it, shall apply: a",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 85
    }
  },
  "86": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c86",
    "text": "international conventions, whether general or particular, establishing rules expressly recognized by the contesting states ; b. international custom, as evidence of a general practice accepted as law; c. the general principles of law recognized by civilized nations ; d. subject to the provisions of Article 59, judicial decisions and the teachings of the most highly qualified publicists of the various nations, as subsidiary means for the determination of rules of law. 2. This provision shall not prejudice the power of the Court to decide a case ex aequo et bond, if the parties agree thereto. CHAPTER III PROCEDURE Article 39 1. The official languages of the Court shall be French and English. If the parties agree that the 26 case shall be conducted in French, the judgment shall be delivered in French. If the parties agree that the case shall be conducted in English, the judgment shall be delivered in English. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 86
    }
  },
  "87": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c87",
    "text": "2. In the absence of an agreement as to which language shall be employed, each party may, in the pleadings, use the language which it prefers; the decision of the Court shall be given in French and English. In this case the Court shall at the same time determine which of the two texts shall be considered as authoritative. 3. The Court shall, at the request of any party, authorize a language other than French or English to be used by that party. Article 40 1. Cases are brought before the Court, as the case may be, either by the notification of the special agreement or by a written application addressed to the Registrar. In either case the subject of the dispute and the parties shall be indicated. 2. The Registrar shall forthwith communicate the application to all concerned. 3. He shall also notify the Members of the United Nations through the Secretary-General, and also any other states entitled to appear before the Court. Article 41 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 87
    }
  },
  "88": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c88",
    "text": "Article 41 1. The Court shall have the power to indicate, if it considers that circumstances so require, any provisional measures which ought to be taken to preserve the respective rights of either party. 2. Pending the final decision, notice of the measures suggested shall forthwith be given to the parties and to the Security Council. Article 42 1. The parties shall be represented by agents. 2. They may have the assistance of counsel or advocates before the Court. 3. The agents, counsel, and advocates of parties before the Court shall enjoy the privileges and immunities necessary to the independent exercise of their duties. Article 43 1. The procedure shall consist of two parts: written and oral. 2. The written proceedings shall consist of the communication to the Court and to the parties of memorials, counter-memorials and, if necessary, replies; also all papers and documents in support. 3",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 88
    }
  },
  "89": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c89",
    "text": "3. These communications shall be made through the Registrar, in the order and within the time fixed by the Court. 4. A certified copy of every document produced by one party shall be communicated to the other party. 5. The oral proceedings shall consist of the hearing by the Court of witnesses, experts, agents, counsel, and advocates. Article 44 1. For the service of all notices upon persons other than the agents, counsel, and advocates, the Court shall apply direct to the government of the state upon whose territory the notice has to be served. 2. The same provision shall apply whenever steps are to be taken to procure evidence on the spot. Article 45 The hearing shall be under the control of the President or, if he is unable to preside, of the VicePresident; if neither is able to preside, the senior judge present shall preside. Article 46 The hearing in Court shall be public, unless the Court shall decide otherwise, or unless the parties demand that the public be not admitted",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 89
    }
  },
  "90": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c90",
    "text": "27 Article 47 1. Minutes shall be made at each hearing and signed by the Registrar and the President. 2. These minutes alone shall be authentic. Article 48 The Court shall make orders for the conduct of the case, shall decide the form and time in which each party must conclude its arguments, and make all arrangements connected with the taking of evidence. Article 49 The Court may, even before the hearing begins, call upon the agents to produce any document or to supply any explanations. Formal note shall be taken of any refusal. Article 50 The Court may, at any time, entrust any individual, body, bureau, commission, or other organization that it may select, with the task of carrying out an enquiry or giving an expert opinion. Article 51 During the hearing any relevant questions are to be put to the witnesses and experts under the conditions laid down by the Court in the rules of procedure referred to in Article 30",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 90
    }
  },
  "91": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c91",
    "text": "Article 52 After the Court has received the proofs and evidence within the time specified for the purpose, it may refuse to accept any further oral or written evidence that one party may desire to present unless the other side consents. Article 53 1. Whenever one of the parties does not appear before the Court, or fails to defend its case, the other party may call upon the Court to decide in favor of its claim. 2. The Court must, before doing so, satisfy itself, not only that it has jurisdiction in accordance with Articles 36 and 37, but also that the claim is well founded in fact and law. Article 54 1. When, subject to the control of the Court, the agents, counsel, and advocates have completed their presentation of the case, the President shall declare the hearing closed. 2. The Court shall withdraw to consider the judgment. 3. The deliberations of the Court shall take place in private and remain secret. Article 55 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 91
    }
  },
  "92": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c92",
    "text": "3. The deliberations of the Court shall take place in private and remain secret. Article 55 1. All questions shall be decided by a maj ority of the judges present. 2. In the event of an equality of votes, the President or the judge who acts in his place shall have a casting vote. Article 56 1. The judgment shall state the reasons on which it is based. 2. It shall contain the names of the judges who have taken part in the decision. Article 57 If the judgment does not represent in whole or in part the unanimous opinion of the judges, any judge shall be entitled to deliver a separate opinion. Article 58 The judgment shall be signed by the President and by the Registrar. It shall be read in open court, due notice having heen given to the agents. Article 59 The decision of the Court has no binding force except between the parties and in respect of that particular case. 28 Article 60 The judgment is final and without appeal",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 92
    }
  },
  "93": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c93",
    "text": "28 Article 60 The judgment is final and without appeal. In the event of dispute as to the meaning or scope of the judgment, the Court shall construe it upon the request of any party. Article 61 1. An application for revision of a judgment may be made only when it is based upon the discovery of some fact of such a nature as to be a decisive factor, which fact was, when the judgment was given, unknown to the Court and also to the party claiming revision, always provided that such ignorance was not due to negligence. 2. The proceedings for revision shall be opened by a judgment of the Court expressly recording the existence of the new fact, recognizing that it has such a character as to lay the case open to revision, and declaring the application admissible on this ground. 3. The Court may require previous compliance with the terms of the judgment before it admits proceedings in revision. 4",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 93
    }
  },
  "94": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c94",
    "text": "4. The application for revision must be made at latest within six months of the discovery of the new fact. 5. No application for revision may be made after the lapse of ten years from the date of the judgment. Article 62 1. Should a state consider that it has an interest of a legal nature which may be affected by the decision in the case, it may submit a request to the Court to be permitted to intervene. 2. It shall be for the Court to decide upon this request. Article 63 1. Whenever the construction of a convention to which states other than those concerned in the case are parties is in question, the Registrar shall notify all such states forthwith. 2. Every state so notified has the right to intervene in the proceedings; but if it uses this right, the construction given by the judgment will be equally binding upon it. Article 64 Unless otherwise decided by the Court, each party shall bear its own costs. CHAPTER IV ADVISORY OPINIONS Article 65 1",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 94
    }
  },
  "95": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c95",
    "text": "CHAPTER IV ADVISORY OPINIONS Article 65 1. The Court may give an advisory opinion on any legal question at the request of whatever body may be authorized by or in accordance with the Charter of the United Nations to make such a request. 2. Questions upon which the advisory opinion of the Court is asked shall be laid before the Court by means of a written request containing an exact statement of the question upon which an opinion is required, and accompanied by all documents likely to throw light upon the question. Article 66 1. The Registrar shall forthwith give notice of the request for an advisory opinion to all states entitled to appear before the Court. 2",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 95
    }
  },
  "96": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c96",
    "text": "2. The Registrar shall also, by means of a special and direct communication, notify any state entitled to appear before the Court or international organization considered by the Court, or, should it not be sitting, by the President, as likely to be able to furnish information on the question, that the Court will be prepared to receive, within a time limit to be fixed by the President, written statements, or to hear, at a public sitting to be held for the purpose, oral statements relating to the question. 29 3. Should any such state entitled to appear before the Court have failed to receive the special communication referred to in paragraph 2 of this Article, such state may express a desire to submit a written statement or to be heard; and the Court will decide. 4",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 96
    }
  },
  "97": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c97",
    "text": "4. States and organizations having presented written or oral statements or both shall be permitted to comment on the statements made brother states or organizations in the form, to the extent, and within the time limits which the Court, or, should it not be sitting, the President, shall decide in each particular case. Accordingly, the Registrar shall in due time communicate any such written statements to states and organizations having submitted similar statements. Article 67 The Court shall deliver its advisory opinions in open court, notice having been given to the Secretary-General and to the representatives of Members of the United Nations, of other states and of international organizations immediately concerned. Article 68 In the exercise of its advisory functions the Court shall further be guided by the provisions of the present Statute which apply in contentious cases to the extent to which it recognizes them to be applicable",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 97
    }
  },
  "98": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c98",
    "text": "CHAPTERV AMENDMENT Article 69 Amendments to the present Statute shall be effected by the same procedure as is provided by the Charter of the United Nations for amendments to that Charter, subject however to any provisions which the General Assembly upon recommendation of the Security Council may adopt concerning the participation of states which are parties to the present Statute but are not Members of the United Nations. Article 70 The Court shall have power to propose such amendments to the present Statute as it may deem necessary, through written communications to the Secretary-General, for consideration in conformity with the provisions of Article 69",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 98
    }
  },
  "99": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c99",
    "text": "30 FOR CHINA: POUR LA CHINE: 3a Kirran: POR LA CHINA: T $ FOR THE UNION OF SOVIET SOCIALIST REPUBLICS: POUR L'UNION DES REPUBLIQUES SOVIETIQUES SOCIALISTES: 3a C0103 COBETCKIIX ComiajiHcnraecKiix Pecnyojimc: POR LA UNION DE REPUBLICAS SOCIALISTAS SOVIETICAS: (H^tMh-—\" FOR THE UNITED KINGDOM OF GREAT BRITAIN AND NORTHERN IRELAND: POUR LE ROYAUME-UNI DE GRANDE-BRETAGNE ET D'IRLANDE DU NORD : 3a Coe^HHeHHoe KopojieBCTBO BejiHEoftpHTamninCeBepHOHH H Ce POR EL REINO UNIDO DE LA GRAN BRETANA E IRLANDA DEL NORTE: FOR THE UNITED STATES OF AMERICA POUR LES ETATS-UNIS D'AMERIQUE: 3a CoeflimeHHBie IHraTH POR LOS ESTAD \"7\" \\L ^A FOR FRANCE: POUR LA FRANCE 3a POR FRANCIA: FOR ARGENTINA: POUR L'ARGENTINE : 3a ApreHTHHy: POR LA ARGENTINA FOR AUSTRALIA: POUR L'AUSTRALIE 3a POR AUSTRAL FOR THE KINGDOM OF BELGIUM: POUR LE ROYAUME DE BELGIQUE : 3a Kopo.ieBCTBo Bejitran: POR EL REINO DE BELGICA: FOR BOLIVIA: POUR LA BOLIVIE 3a BojniBiiio: POR BOLIVIA: FOR BRAZIL: POUR LE BRESIL: 3a Bpa3iiJiino: POR EL",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 99
    }
  },
  "100": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c100",
    "text": "BELGICA: FOR BOLIVIA: POUR LA BOLIVIE 3a BojniBiiio: POR BOLIVIA: FOR BRAZIL: POUR LE BRESIL: 3a Bpa3iiJiino: POR EL BRASIL: 'C-<--i»_-»—•—• \\j FOR THE BYELORUSSIAN SOVIET SOCIALIST REPUBLIC : POUR LA REPUBLIQUE SOVIETIQUE SOCIALISTE DEBELORUSSIE 3a BejiopyccKyio CoeeTCKyio CounajincTinecKyio Pecny6jiHKy: POR LA REPUBLICA SOCIALISTA SOVIETICA BIELORRUSA: FOR CANADA: POUR LE CANADA 3a POR EL CANADA: FOR CHILE: POUR LE CHILI: 3a POR CHILE; (^J^VY //l *^ FOR COLOMBIA: POUR LA COLOMBIE Ff 5 * 1 3a POR COLOMBIA: FOR COSTA RICA: POUR COSTA-RICA 3a KocTapmcy: POR COSTA RICA: FOR CUBA: POUR CUBA 3a Kyoy: POR CUBA: FOR CZECHOSLOVAKIA: POUR LA TCHECOSLOVAQUIE 3a lIexocjioBaKHH): POR CHECOESLOVAQUIA: FOR DENMARK: POUR LE DANEMARK 3a J POR DINAMARCA: FOR THE DOMINICAN REPUBLIC: POUR LA REPUBLIQUE DOMINICAINE: 3a /JoMEHHKaHCKyio Pec POR LA REPUBLIC A FOR ECUADOR: POUR L'EQUATEUR 3a POR EL ECUADOR: FOR EGYPT: POUR L'EGYPTE: ^A^K^J^ilíL 3a POR EGIPTO: FOR EL SALVADOR: POUR LE SALVADOR 3a POR EL",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 100
    }
  },
  "101": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c101",
    "text": "3a POR EL ECUADOR: FOR EGYPT: POUR L'EGYPTE: ^A^K^J^ilíL 3a POR EGIPTO: FOR EL SALVADOR: POUR LE SALVADOR 3a POR EL SALVADOR: r FOR ETHIOPIA: POUR L'ETHIOPIE 3a POR ETIOPIA: FOR GREECE: POUR LA GRECE: 3a rpemiio: POR GRECIA: / FOR GUATEMALA: POUR LE GUATEMALA JBUU& 3a FBaTeMajiy: POR GUATEMALA FOR HAITI: POUR HAITI: 3a POR HAITI : FOR HONDURAS: POUR LE HONDURAS: 3a FoHflypac: POR HONDURAS: FOR INDIA: POUR L'INDE: 3a HH,¡JHIO: POR LA INDIA: FOR IRAN: POUR L'IRAN: 3a Hpan: POR IRAN: FOR IRAQ: POUR L'IRAK: 3a Hpaie: POR IRAK: FOR LEBANON: POUR LE LIBAN 3a POR EL LIBANO FOR LIBERIA: POUR LE LIBERIA: 3a JTHÔepmo: POR LIBERIA FOR THE GRAND DUCHY OF LUXEMBOURG POUR LE GRAND DUCHE DE LUXEMBOURG 3a BejiHKoe FepuorcTBo JIroKceM6ypr: POR EL GRAN DUCADO DE LUXEMBURGO: FOR MEXICO : POUR LE MEXIQUE : 3a MeKcmcy: POR MEXICO: FOR THE KINGDOM OF THE NETHERLANDS POUR LE ROYAUME DES PAYS-BAS : 3a KopojieBCTBo POR EL REINO DE HOLANDA: FOR NEW ZEALAND: POUR LA NOUVELLE-ZELANDE: 3a HOBVK) 3ejiaHffHio: POR",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 101
    }
  },
  "102": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c102",
    "text": ": 3a KopojieBCTBo POR EL REINO DE HOLANDA: FOR NEW ZEALAND: POUR LA NOUVELLE-ZELANDE: 3a HOBVK) 3ejiaHffHio: POR NUEVA ZELANDIA: FOR NICARAGUA: POUR LE NICARAGUA: 3a HnKaparya: POR NICARAGUA: FOR THE KINGDOM OF NORWAY: POUR LE ROYAUME DE NORVÈGE: 3a KopojiescTBO HopBerm: POR EL REINO DE NORUEGA: FOR PANAMA: POUR LE PANAMA: 3a POR PANAMA: FOR PARAGUAY: POUR LE PARAGUAY 3a IlaparBaH: POR EL PARAGUAY: FOR PERU: POUR LE PEROU: 3a Ilepy: POR EL PERU: FOR.THE PHILIPPINE COMMONWEALTH: POUR LE COMMONWEALTH DES PHILIPPINES: 3a POR LA MANCOMUNIDAD DE FILIPINAS: / * / FOR POLAND: POUR LA POLOGNE 3a IIojiBiny: POR POLONIA: FOR SAUDI ARABIA: POUR L'ARABIE SAOUDITE 3a Cay#n ApaBHio: POR ARABIA SAUDITA: FOR SYRIA: POUR LA SYRIE: 3a Cnpnio: POR SIRIA: FOR TURKEY: POUR LA TURQUIE 3aTypupEDEo: POR TURQUIA: FOR THE UKRAINIAN SOVIET SOCIALIST REPUBLIC: POUR LA RÉPUBLIQUE SOVIÉTIQUE SOCIALISTE D'UKRAINE: 8a yKpaHHCKyio CoBeTCKyio Coi^iiajmcTn^ecKyio Pecnydjimcy: POR LA REPÚBLICA SOCIALISTA SOVIÉTICA",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 102
    }
  },
  "103": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c103",
    "text": "D'UKRAINE: 8a yKpaHHCKyio CoBeTCKyio Coi^iiajmcTn^ecKyio Pecnydjimcy: POR LA REPÚBLICA SOCIALISTA SOVIÉTICA UCRANIANA: J ut ^vwi/V(ro FOR THE UNION OF SOUTH AFRICA: POUR L'UNION SUD-AFRICAINE: 3a IOiKHoa^pmcaHCKiiH C0103: POR LA UNIÓN SUDAFRICANA: o FOR URUGUAY: POUR L'URUGUAY 3a POR EL URUGUAY FOR VENEZUELA: POUR LE VENEZUELA: 8a BeHecyaziy: POR VENEZUELA: FOR YUGOSLAVIA: POUR LA YOUGOSLAVIE 3a K)rocJiaBmo: POR YUGOSLAVIA: I Certify 1hat the foregoing is a true copy of the Charter of the United Nations, with the Statute of the International Court of Justice annexed thereto, signed in San Francisco, California, on June 26,1945, in the Chinese, French, Russian, English, and Spanish languages, the signed original of which is deposited in the archives of the Government of the United States of America",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 103
    }
  },
  "104": {
    "id": "2151c22b-36db-4751-98d3-8b51b795fbb0_c104",
    "text": "In Testimony Whereof, I, EDWARD R. STETTINIUS, JR., Secretary of State, have hereunto caused the seal of the Department of State to be affixed and my name subscribed by an Assistant Chief, Division of Central Services of the said Department, at the city of Washington, in the District of Columbia, this twenty-qewwroilay of June1945. Se/ifeUiTyjof State Assistant Chief, Division of Central Services",
    "metadata": {
      "file_id": "2151c22b-36db-4751-98d3-8b51b795fbb0",
      "chunk_index": 104
    }
  },
  "105": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c0",
    "text": "CHARTER OF THE UNITED NATIONS AND STATUTE OF THE INTERNATIONAL COURT OF JUSTICE SAN FRANCISCO • 1945 CHARTER OF THE UNITED NATIONS WE THE PEOPLES OF THE UNITED NATIONS DETERMINED to save succeeding generations from the scourge of war, which twice in our lifetime has brought untold sorrow to mankind, and to reaffirm faith in fundamental human rights, in the dignity and worth of the human person, in the equal rights of men and women and of nations large and small, and to establish conditions under which justice and respect for the obligations arising from treaties and other sources of international law can be maintained, and to promote social progress and better standards of life in larger freedom, AND FOR THESE ENDS to practice tolerance and live together in peace with one another as good neighbors, and to unite our strength to maintain international peace and security, and to ensure, by the acceptance of principles and the institution of methods, that armed force shall not be used,",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 0
    }
  },
  "106": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c1",
    "text": "and to ensure, by the acceptance of principles and the institution of methods, that armed force shall not be used, save in the common interest, and to employ international machinery for the promotion of the economic and social advancement of all peoples, HAVE RESOLVED TO COMBINE OUR EFFORTS TO ACCOMPLISH THESE AIMS",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 1
    }
  },
  "107": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c2",
    "text": "Accordingly, our respective Governments, through representatives assembled in the city of San Francisco, who have exhibited their full powers found to be in good and due form, have agreed to the present Charter of the United Nations and do hereby establish an international organization to be known as the United Nations. CHAPTER I PURPOSES AND PRINCIPLES Article 1 The^Purposes of the United Nations are: 1. To maintain international peace and security, and to that end: to take effective collective measures for the prevention and removal of threats to the peace, and for the suppression of acts of aggression or other breaches of the peace, and to bring about by peaceful means, and in conformity with the principles of justice and international law, adjustment or settlement of international disputes or situations which might lead to a breach of the peace; 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 2
    }
  },
  "108": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c3",
    "text": "To develop friendly relations among nations based on respect for the principle of equal rights and self-determination of peoples, and to take other appropriate measures to strengthen universal peace; 3. To achieve international cooperation in solving international problems of an economic, social, cultural, or humanitarian character, and in promoting and encouraging respect for human rights and for fundamental freedoms for all without distinction as to race, sex, language, or religion; and 4. To be a center for harmonizing the actions of nations in the attainment of these common ends. Article 2 The Organization and its Members, in pursuit of the Purposes stated in Article 1, shall act in accordance with the following Principles. 1. The Organization is based on the principle of the sovereign equality of all its Members. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 3
    }
  },
  "109": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c4",
    "text": "1. The Organization is based on the principle of the sovereign equality of all its Members. 2. All Members, in order to ensure to all of them the rights and benefits resulting from membership, shall fulfil in good faith the obligations assumed by them in accordance with the present Charter. 3. All Members shall settle their international disputes by peaceful means in such a manner that international peace and security, and justice, are not endangered. 4. All Members shall refrain in their international relations from the threat or use of force against the territorial integrity or political independence of any state, or in any other manner inconsistent with the Purposes of the United Nations. 5. All Members shall give the United Nations every assistance in any action it takes in accordance with the present Charter, and shall refrain from giving assistance to any state against which the United Nations is taking preventive or enforcement action. 6",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 4
    }
  },
  "110": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c5",
    "text": "6. The Organization shall ensure that states which are not Members of the United Nations act in accordance with these Principles so far as may be necessary for the maintenance of international peace and security. 7. Nothing contained in the present Charter shall authorize the United Nations to intervene in matters which are essentially within the domestic jurisdiction of any state or shall require the Members to submit such matters to settlement under the present Charter; but this principle shall not prejudice the application of enforcement measures under Chapter VII. CHAPTER II MEMBERSHIP Article 3 The original Members of the United Nations shall be the states which, having participated in the United Nations Conference on International Organization at San Francisco, or having previously signed the Declaration by United Nations of January 1,1942, sign the present Charter and ratify it in accordance with Article 110. Article 4 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 5
    }
  },
  "111": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c6",
    "text": "Article 4 1. Membership in the United Nations is open to all other peace-loving states which accept the obligations contained in the present Charter and, in the judgment of the Organization, are able and willing to carry out these obligations. 2. The admission of any such state to membership in the United Nations will be effected by a decision of the General Assembly upon the recommendation of the Security Council. Article 5 / A Member of the United Nations against which preventive or enforcement action has been taken by the Security Council may be suspended from the exercise of the rights and privileges of membership by the General Assembly upon the recommendation of the Security Council. The exercise of these rights and privileges may be restored by the Security Council",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 6
    }
  },
  "112": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c7",
    "text": "The exercise of these rights and privileges may be restored by the Security Council. Article 6 A Member of the United Nations which has persistently violated the Principles contained in the present Charter may be expelled from the Organization by the General Assembly upon the recommendation of the Security Council. CHAPTER III ORGANS Article 7 1. There are established as the principal organs of the United Nations: a General Assembly, a Security Council, an Economic and Social Council, a Trusteeship Council, an International Court of Justice, and a Secretariat. 2. Such subsidiary organs as may be found necessary may be established in accordance with the present Charter. Article 8 The United Nations shall place no restrictions on the eligibility of men and women to participate in any capacity and under conditions of equality in-its principal and subsidiary organs. CHAPTER IV THE GENERAL ASSEMBLY Composition Article 9 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 7
    }
  },
  "113": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c8",
    "text": "CHAPTER IV THE GENERAL ASSEMBLY Composition Article 9 1. The General Assembly shall consist of all the Members of the United Nations. 2. Each Member shall have not more than five representatives in the General Assembly. Functions and Powers Article 10 The General Assembly may discuss any questions or any matters within the scope of the present Charter or relating to the powers and functions of any organs provided for in the present Charter, and, except as provided in Article 12, may make recommendations to the Members of the United Nations or to the Security Council or to both on any such questions or matters. Article 11 1. The General Assembly may consider the general principles of cooperation in the maintenance of international peace and security, including the principles governing disarmament and the regulation of armaments, and may make recommendations with regard to such principles to the Members or to the Security Council or to both. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 8
    }
  },
  "114": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c9",
    "text": "2. The General Assembly may discuss any questions relating to the maintenance of international peace and security brought before it by any Member of the United Nations, or by the Security Council, or by a state which is not a Member of the United Nations in accordance with Article 35, paragraph 2, and, except as provided in Article 12, may make recommendations with regard to any such questions to the state or states concerned or to the Security Council or to both. Any such question on which action is necessary shall be referred to the Security Council by the General Assembly either before or after discussion. 3. The General Assembly may call the attention of the Security Council to situations which are likely to endanger international peace and security. 4. The powers of the General Assembly set forth in this Article shall not limit the general scope of Article 10. Article 12 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 9
    }
  },
  "115": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c10",
    "text": "Article 12 1. While the Security Council is exercising in respect of any dispute or situation the functions assigned to it in the present Charter, the General Assembly shall not make any recommendation with regard to that dispute or situation unless the Security Council so requests. 2. The Secretary-General, with the consent of the Security Council, shall notify the General Assembly at each session of any matters relative to the maintenance of international peace and security which are being dealt with by the Security Council and shall similarly notify the General Assembly, or the Members of the United Nations if the General Assembly is not in session, immediately the Security Council ceases to deal with such matters. Article 13 1. The General Assembly shall initiate studies and make recommendations for the purpose of : a. promoting international cooperation in the political field and encouraging the progressive development of international law and its codification; b",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 10
    }
  },
  "116": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c11",
    "text": "promoting international cooperation in the economic, social, cultural, educational, and health fields, and assisting in the realization of human rights and fundamental freedoms for all without distinction as to race, sex, language, or religion. 2. The further responsibilities, functions, and powers of the General Assembly with respect to matters mentioned in paragraph l(b) above are set forth in Chapters IX and X. Article 14 Subject to the provisions of Article 12, the General Assembly may recommend measures for the peaceful adjustment of any situation, regardless of origin, which it deems likely to impair the general welfare or friendly relations among nations, including situations resulting from a violation of the provisions of the present Charter setting forth the Purposes and Principles of the United Nations. Article 15 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 11
    }
  },
  "117": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c12",
    "text": "Article 15 1. The General Assembly shall receive and consider annual and special reports from the Security Council; these reports shall include an account of the measures that the Security Council has decided upon or taken to maintain international peace and security. 2. The General Assembly shall receive and consider reports from the other organs of the United Nations. Article 16 The General Assembly shall perform such functions with respect to the international trusteeship system as are assigned to it under Chapters XII and XIII, including the approval of the trusteeship agreements for areas not designated as strategic. Article 17 1. The General Assembly shall consider and approve the budget of the Organization. 2. The expenses of the Organization shall be borne by the Members as apportioned by the General Assembly. 3",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 12
    }
  },
  "118": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c13",
    "text": "3. The General Assembly shall consider and approve any financial and budgetary arrangements with specialized agencies referred to in Article 57 and shall examine the administrative budgets of such specialized agencies with a view to making recommendations to the agencies concerned. Voting Article 18 1. Each member of the General Assembly shall have one vote. 2. Decisions of the General Assembly on important questions shall be made by a two-thirds majority of the members present and voting",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 13
    }
  },
  "119": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c14",
    "text": "These questions shall include: recommendations with respect to the maintenance of international peace and security, the election of the non-permanent members of the Security Council, the election of the members of the Economic and Social Council, the election of members of the Trusteeship Council in accordance with paragraph l(c) of Article 86, the admission of new Members to the United Nations, the suspension of the rights and privileges of membership, the expulsion of Members, questions relating to the operation of the trusteeship system, and budgetary questions. 3. Decisions on other questions, including the determination of additional categories of questions to be decided by a two-thirds majority, shall be made by a majority of the members present and voting",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 14
    }
  },
  "120": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c15",
    "text": "Article 19 A Member of the United Nations which is in arrears in the payment of its financial contributions to the Organization shall have no vote in the General Assembly if the amount of its arrears equals or exceeds the amount of the contributions due from it for the preceding two full years. The General Assembly may, nevertheless, permit such a Member to vote if it is satisfied that the failure to pay is due to conditions beyond the control of the Member. Procedure Article 20 The General Assembly shall meet in regular annual sessions and in such special sessions as occasion may require. Special sessions shall be convoked by the Secretary-General at the request of the Security Council or of a majority of the Members of the United Nations. Article 21 The General Assembly shall adopt its own rules of procedure. It shall elect its President for each session. Article 22 The General Assembly may establish such subsidiary organs as it deems necessary for the performance of its functions",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 15
    }
  },
  "121": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c16",
    "text": "CHAPTER V THE SECURITY COUNCIL Composition Article 23 1. The Security Council shall consist of eleven Members of the United Nations. The Republic of China, France, the Union of Soviet Socialist Republics, the United Kingdom of Great Britain and Northern Ireland, and the United States of America shall be permanent members of the Security Council. The General Assembly shall elect six other Members of the United Nations to be non-permanent members of the Security Council, due regard being specially paid, in the first instance to the contribution of Members of the United Nations to the maintenance of international peace and security and to the other purposes of the Organization, and also to equitable geographical distribution. 2. The non-permanent members of the Security Council shall be elected for a term of two years. In the first election of the non-permanent members, however, three shall be chosen for a term of one year",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 16
    }
  },
  "122": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c17",
    "text": "A retiring member shall not be eligible for immediate re-election. 3. Each member of the Security Council shall have one representative. Functions and Powers Article 24 1. In order to ensure prompt and effective action by the United Nations, its Members confer on the Security Council primary responsibility for the maintenance of international peace and security, and agree that in carrying out its duties under this responsibility the Security Council acts on their behalf. 2. In discharging these duties the Security Council shall act in accordance with the Purposes and Principles of the United Nations. The specific powers granted to the Security Council for the discharge of these duties are laid down in Chapters VI, VII, VIII, and XII. 3. The Security Council shall submit annual and, when necessary, special reports to the General Assembly for its consideration",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 17
    }
  },
  "123": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c18",
    "text": "Article 25 The Members of the United Nations agree to accept and carry out the decisions of the Security Council in accordance with the present Charter. Article 26 In order to promote the establishment and maintenance of international peace and security with the least diversion for armaments of the world's human and economic resources, the Security Council shall be responsible for formulating, with the assistance of the Military Staff Committee referred to in Article 47, plans to be submitted to the Members of the United Nations for the establishment of a system for the regulation \"of armaments. Voting Article 27 1. Each member of the Security Council shall have one vote. 2. Decisions of the Security Council on procedural matters shall be made by an affirmative vote of seven members. 3",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 18
    }
  },
  "124": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c19",
    "text": "3. Decisions of the Security Council on all other matters shall be made by an affirmative vote of seven members including the concurring votes of the permanent members ; provided that, in decisions under Chapter VI, and under paragraph 3 of Article 52, a party to a dispute shall abstain from voting. Procedure Article 1. The Security Council shall be so organized as to be able to function continuously. Each member of the Security Council shall for this purpose be represented at all times at the seat of the Organization. 2. The Security Council shall hold periodic meetings at which each of its members may, if it so desires, be represented by a member of the government or by some other specially designated representative. 3. The Security Council may hold meetings at such places other than the seat of the Organization as in its judgment will best facilitate its work",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 19
    }
  },
  "125": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c20",
    "text": "Article 29 The Security Council may establish such subsidiary organs as it deems necessary for the performance of its functions. Article 30 The Security Council shall adopt its own rules of procedure, including the method of selecting its President. Article 31 Any Member of the United Nations which is not a member of the Security Council may participate, without vote, in the discussion of any question brought before the Security Council whenever the latter considers that the interests of that Member are specially affected. Article 32 Any Member of the United Nations which is not a member of the Security Council or any state which is not a Member of the United Nations, if it is a party to a dispute under consideration by the Security Council, shall be invited to participate, without vote, in the discussion relating to the dispute. The Security Council shall lay down such conditions as it deems just for the participation, of a state which is not a Member of the United Nations",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 20
    }
  },
  "126": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c21",
    "text": "CHAPTER VI PACIFIC SETTLEMENT OF DISPUTES Article 33 1. The parties to any dispute, the continuance of which is likely to endanger the maintenance of international peace and security, shall, first of all, seek a solution by negotiation, enquiry, mediation, conciliation, arbitration, judicial settlement, resort to regional agencies or arrangements, or other peaceful means of their own choice. 2. The Security Council shall, when it deems necessary, call upon the parties to settle their dispute by such means. Article 34 The Security Council may investigate any dispute, or any situation which might lead to international friction or give rise to a dispute, in order to determine whether the continuance of the dispute or situation is likely to endanger the maintenance of international peace and security. Article 35 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 21
    }
  },
  "127": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c22",
    "text": "Article 35 1. Any Member of the United Nations may bring any dispute, or any situation of the nature referred to in Article 34, to the attention of the Security Council or of the General Assembly. 2. A state which is not a Member of the United Nations may bring to the attention of the Security Council or of the General Assembly any dispute to which it is a party if it accepts in advance, for the purposes of the dispute, the obligations of pacific settlement provided in the present Charter. 3. The proceedings of the General Assembly in respect of matters brought to its attention under this Article will be subject to the provisions of Articles 11 and 12. Article 36 1. The Security Council may, at any stage of a dispute of the nature referred to in Article 33 or of a situation of like nature, recommend appropriate procedures or methods of adjustment. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 22
    }
  },
  "128": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c23",
    "text": "2. The Security Council should take into consideration any procedures for the settlement of the dispute which have already been adopted by the parties. 3. In making recommendations under this Article the Security Council should also take into consideration that legal disputes should as a general rule be referred by the parties to the International Court of Justice in accordance with the provisions of the Statute of the Court. Article 37 1. Should the parties to a dispute of the nature referred to in Article 33 fail to settle it by the means indicated in that Article, they shall refer it to the Security Council. 8 2. If the Security Council deems that the continuance of the dispute is in fact likely to endanger the maintenance of international peace and security, it shall decide whether to take action under Article 36 or to recommend such terms of settlement as it may consider appropriate",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 23
    }
  },
  "129": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c24",
    "text": "Article 38 Without prejudice to the provisions of Articles 33 to 37, the Security Council may, if all the parties to any dispute so request, make recommendations to the parties with a view to a pacific settlement of the dispute. CHAPTER W ACTION WITH RESPECT TO THREATS TO THE PEACE, BREACHES OF THE PEACE, AND ACTS OF AGGRESSION Article 39 The Security Council shall determine the existence of any threat to the peace, breach of the peace, or act of aggression and shall make recommendations, or decide what measures shall be taken in accordance with Articles 41 and 42, to maintain or restore international peace and security. Article 40 In order to prevent an aggravation of the situation, the Security Council may, before making the recommendations or deciding upon the measures provided for in Article 39, call upon the parties concerned to comply with such provisional measures as it deems necessary or desirable",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 24
    }
  },
  "130": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c25",
    "text": "Such provisional measures shall be without prejudice to the rights, claims, or position of the parties concerned. The Security Council shall duly take account of failure to comply with such provisional measures. Article 41 The Security Council may decide what measures not involving the use of armed force are to be employed to give effect to its decisions, and it may call upon the Members of the United Nations to apply such measures. These may include complete or partial interruption of economic relations and of rail, sea, air, postal, telegraphic, radio, and other means of communication, and the severance of diplomatic relations. Article 42 Should the Security Council consider that measures provided for in Article 41 would be inadequate or have proved to be inadequate, it may take such action by air, sea, or land forces as may be necessary to maintain or restore international peace and security",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 25
    }
  },
  "131": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c26",
    "text": "Such action may include demonstrations, blockade, and other operations by air, sea, or land forces of Members of the United Nations. Article 43 1. All Members of the United Nations, in order to contribute to the maintenance of international peace and security, undertake to make available to the Security Council, on its call and in accordance with a special agreement or agreements, armed forces, assistance, and facilities, including rights of passage, necessary for the purpose of maintaining international peace and security. 2. Such agreement or agreements shall govern the numbers and types of forces, their degree of readiness and general location, and the nature of the facilities and assistance to be provided. 3. The agreement or agreements shall be negotiated as soon as possible on the initiative of the Security Council",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 26
    }
  },
  "132": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c27",
    "text": "They shall be concluded between the Security Council and Members or between the Security Council and groups of Members and shall be subject to ratification by the signatory states in accordance with their respective constitutional processes. Article 44 When the Security Council has decided to use force it shall, before calling upon a Member not represented on it to provide armed forces in fulfilhnent of the obligations assumed under Article 43, invite that Member, if the Member so desires, to participate in the decisions of the Security Council concerning the employment of contingents of that Member's armed forces. Article 45 In order to enable the United Nations to take urgent military measures, Members shall hold immediately available national air-force contingents for combined international enforcement action",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 27
    }
  },
  "133": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c28",
    "text": "The strength and degree of readiness of these contingents and plans for their combined action shall be determined, within the limits laid down in the special agreement or agreements referred to in Article 43, by the Security Council with the assistance of the Military Staff Committee. Article 46 Plans for the application of armed force shall be made by the Security Council with the assistance of the Military Staff Committee. Article 47 1. There shall be established a Military Staff Committee to advise and assist the Security Council on all questions relating to the Security Council's military requirements for the maintenance of international peace and security, the employment and command of forces placed at its disposal, the regulation of armaments, and possible disarmament. 2. The Military Staff Committee shall consist of the Chiefs of Staff of the permanent members of the Security Council or their representatives",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 28
    }
  },
  "134": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c29",
    "text": "Any Member of the United Nations not permanently represented on the Committee shall be invited by the Committee to be associated with it when the efficient discharge of the Committee's responsibilities requires the participation of that Member in its work. 3. The Military Staff Committee shall be responsible under the Security Council for the strategic direction of any armed forces placed at the disposal of the Security Council. Questions relating to the command of such forces shall be worked out subsequently. 4. The Military Staff Committee, with the authorization of the Security Council and after consultation with appropriate regional agencies, may establish regional subcommittees. Article 48 1. The action required to carry out the decisions of the Security Council for the maintenance of international peace and security shall be taken by all the Members of the United Nations or by some of them, as the Security Council may determine. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 29
    }
  },
  "135": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c30",
    "text": "2. Such decisions shall be carried out by the Members of the United Nations directly and through their action in the appropriate international agencies of which they are members. Article 49 The Members of the United Nations shall join in affording mutual assistance in carrying out the measures decided upon by the Security Council. Article 50 If preventive or enforcement measures against any state are taken by the Security Council, any other state, whether a Member of the United Nations or not, which finds itself confronted with special economic problems arising from the carrying out of those measures shall have the right to consult the Security Council with regard to a solution of those problems. Article 51 Nothing in the present Charter shall impair the inherent right of individual or collective selfdefense if an armed attack occurs against a Mem10 her of the United Nations, until the Security Council has taken the measures necessary to maintain international peace and security",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 30
    }
  },
  "136": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c31",
    "text": "Measures taken by Members in the exercise of this right of selfdefense shall be immediately reported to the Security Council and shall not in any way affect the authority and responsibility of the Security Council under the present Charter to take at any time such action as it deems necessary in order to maintain or restore international peace and security. CHAPTER VIII REGIONAL ARRANGEMENTS Article 52 1. Nothing in the present Charter precludes the existence of regional arrangements or agencies for dealing with such matters relating to the maintenance of international peace and security as are appropriate for regional action, provided that such arrangements or agencies and their activities are consistent with the Purposes and Principles of the United Nations. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 31
    }
  },
  "137": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c32",
    "text": "2. The Members of the United Nations entering into such arrangements or constituting such agencies shall make every effort to achieve pacific settlement of local disputes through such regional arrangements or by such regional agencies before referring them to the Security Council. 3. The Security Council shall encourage the development of pacific settlement of local disputes through such regional arrangements or by such regional agencies either on the initiative of the states concerned or by reference from the Security Council. 4. This Article in no way impairs the application of .Articles 34 and 35. Article 53 1. The Security Council shall, where appropriate, utilize such regional arrangements or agencies for enforcement action Under its authority",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 32
    }
  },
  "138": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c33",
    "text": "But no enforcement action shall be taken under regional arrangements or by regional agencies without the authorization of the Security Council * with the exception of measures against any enemy state, as defined in paragraph 2 of this Article, provided for pursuant to Article 107 or in regional arrangements directed against renewal of aggressive policy on the part of any such state, until such time as the Organization may, on request of the Governments concerned, be charged with the responsibility for preventing further aggression by such a state. 2. The term enemy state as used in paragraph 1 of this Article applies to any state which during the Second World War has been an enemy of any signatory of the present Charter. Article 54 The Security Council shall at all times be kept fully informed of activities undertaken or in contemplation under regional arrangements or by regional agencies for the maintenance of international peace and security",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 33
    }
  },
  "139": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c34",
    "text": "CHAPTER IX INTERNATIONAL ECONOMIC AND SOCIAL COOPERATION Article 55 With a view to the creation of conditions of stability and well-being which are necessary for peaceful and friendly relations among nations based on respect for the principle of equal rights and self-determination of peoples, the United Nations shall promote: a. higher standards of living, full employment, and conditions of economic and social progress and development; b. solutions of international economic, social, health, and related problems; and inter11 national cultural and educational cooperation; and c. universal respect for, and observance of, human rights and fundamental freedoms for all without distinction as to race, sex, language, or religion. Article 56 All Members pledge themselves to take joint and separate action in cooperation with the Organization for the achievement of the purposes set forth in Article 55. Article 57 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 34
    }
  },
  "140": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c35",
    "text": "Article 57 1. The various specialized agencies, established by intergovernmental agreement and having wide international responsibilities, as defined in their basic instruments, in economic, social, cultural, educational, health, and related fields, shall be brought into relationship with the United Nations in accordance with the provisions of Article 63. 2. Such agencies thus brought into relationship with the United Nations are hereinafter referred to as specialized agencies. Article 58 The Organization shall make recommendations for the coordination of the policies and activities of the specialized agencies. Article 59 The Organization shall, where appropriate, initiate negotiations among the states concerned for the creation of any new specialized agencies required for the accomplishment of the purposes set forth in Article 55",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 35
    }
  },
  "141": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c36",
    "text": "Article 60 Responsibility for the discharge of the functions of the Organization set forth in this Chapter shall be vested in the General Assembly and, under the authority of the General Assembly, in 12 the Economic and Social Council, which shall have for this purpose the powers set forth in Chapter X. CHAPTER X THE ECONOMIC AND SOCIAL COUNCIL Composition Article 61 1. The Economic and Social Council shall consist of eighteen Members of the United Nations elected by the General Assembly. 2. Subject to the provisions of paragraph 3, six members of the Economic and Social Council shall be elected each year for a term of three years. A retiring member shall be eligible for immediate re-election. 3. At the first election, eighteen members of the Economic and Social Council shall be chosen. The term of office of six members so chosen shall expire at the end of one year, and of six other members at the end of two years, in accordance with arrangements made by the General Assembly. 4",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 36
    }
  },
  "142": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c37",
    "text": "4. Each member of the Economic and Social Council shall have one representative. Functions and Powers Article 62 1. The Economic and Social Council may make or initiate studies and reports with respect to international economic, social, cultural, educational, health, and related matters and may make recommendations with respect to any such matters to the General Assembly, to the Members of the United Nations, and to the specialized agencies concerned. 2. It may make recommendations for the purpose of promoting respect for, and observance of, human rights and fundamental freedoms for all. 3. It may prepare draft conventions for submission to the General Assembly, with respect to matters falling within its competence. 4. It may call, in accordance with the rules prescribed by the United Nations, international conferences on matters falling within its competence. Article 63 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 37
    }
  },
  "143": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c38",
    "text": "Article 63 1. The Economic and Social Council may enter into agreements with any of the agencies referred to in Article 57, defining the terms on which the agency concerned shall be brought into relationship with the United Nations. Such agreements shall be subject to approval by the General Assembly. 2. It may coordinate the activities of the specialized agencies through consultation with and recommendations to such agencies and through recommendations to the General Assembly and to the Members of the United Nations. Article 64 1. The Economic and Social Council may take appropriate steps to obtain regular reports from the specialized agencies. It may make arrangements with the Members of the United Nations and with the specialized agencies to obtain reports on the steps taken to give effect to its own recommendations and to recommendations on matters falling within its competence made by the General Assembly. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 38
    }
  },
  "144": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c39",
    "text": "2. It may communicate its observations on these reports to the General Assembly. Article 65 The Economic and Social Council may furnish information to the Security Council and shall assist the Security Council upon its request. Article 66 1. The Economic and Social Council shall perform such functions as fall within its competence in connection with the carrying out of the recommendations of the General Assembly. 2. It may, with the approval of the General Assembly, perform services at the request of Members of the United Nations and at the request of specialized agencies. 3. It shall perform such other functions as are specified elsewhere in the present Charter or as may be assigned to it by the General Assembly. Voting Article 67 1. Each member of the Economic and Social Council shall have one vote. 2. Decisions of the Economic and Social Council shall be made by a majority of the members present and voting",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 39
    }
  },
  "145": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c40",
    "text": "Procedure Article 68 The Economic and Social Council shall set up commissions in economic and social fields and for the promotion of human rights, and such other commissions as may be required for the performance of its functions. Article 69 The Economic and Social Council shall invite any Member of the United Nations to participate, without vote, in its deliberations on any matter of particular concern to that Member. Article 70 The Economic and Social Council may make arrangements for representatives of the specialized agencies to participate, without vote, in its deliberations and in those of the commissions established by it, and for its representatives to participate in the deliberations of the specialized agencies. Article 71 The Economic and Social Council may make suitable arrangements for consultation with nongovernmental organizations which are concerned with matters within its competence",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 40
    }
  },
  "146": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c41",
    "text": "Such arrange13 ments may be made with international organizations and, where appropriate, with national organizations after consultation with the Member of the United Nations concerned. Article 72 1. The Economic and Social Council shall adopt its own rules of procedure, including the method of selecting its President. 2. The Economic and Social Council shall meet as required in accordance with its rules, which shall include provision for the convening of meetings on the request of a majority of its members",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 41
    }
  },
  "147": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c42",
    "text": "CHAPTER XI DECLARATION REGARDING NON-SELF-GOVERNING TERRITORIES Article 73 Members of the United Nations which have or assume responsibilities for the administration of territories whose peoples have not yet attained a full measure of self-government recognize the principle that the interests of the inhabitants of these territories are paramount, and accept as a sacred trust the obligation to promote to the utmost, within the system of international peace and security established by the present Charter, the well-being of the inhabitants of these territories, and, to this end: a. to ensure, with due respect for the culture of the peoples concerned, their political, economic, social, and educational advancement, their just treatment, and their protection against abuses; b",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 42
    }
  },
  "148": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c43",
    "text": "to develop self-government, to take due account of the political aspirations of the peoples, and to assist them in the progressive development of their free political institutions, according to the particular circumstances of each territory and its peoples and their varying i stages of advancement; c. to further international peace and security; d. to promote constructive measures of development, to encourage research, and to cooperate with one another and, when and where appropriate, with specialized international bodies with a view to the practical achievement of the social, economic, and scientific purposes set forth in this Article; and e",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 43
    }
  },
  "149": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c44",
    "text": "to transmit regularly to the SecretaryGeneral for information purposes, subject to such limitation as security and constitutional considerations may require, statistical and other information of a technical nature relating to economic, social, and educational conditions in the territories for which they are respectively responsible other than those territories to which Chapters XII and XIII apply. Article 74 Members of the United Nations also agree that their policy in respect of the territories to which this Chapter applies, no less than in respect of their metropolitan areas, must be based on the general principle of good-neighborliness, due account being taken of the interests and well-being of the rest of the world, in social, economic, and commercial matters",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 44
    }
  },
  "150": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c45",
    "text": "CHAPTER XII INTERNATIONAL TRUSTEESHIP SYSTEM Article 75 The United Nations shall establish under its authority an international trusteeship system for the administration and supervision of such territories as may be placed thereunder by subsequent individual agreements. These territories are hereinafter referred to as trust territories. Article 76 The basic objectives of the trusteeship system, 14 in accordance with the Purposes of the United Nations laid down in Article 1 of the present Charter, shall be: a. to further international peace and security; b. to promote the political, economic, social, and educational advancement of the inhabitants of the trust territories, and their progressive development towards self-government or independence as may be appropriate to the particular circumstances of each territory and its peoples and the freely expressed wishes of the peoples concerned, and as may be provided by the terms of each trusteeship agreement; c",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 45
    }
  },
  "151": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c46",
    "text": "to encourage respect for human rights and for fundamental freedoms for all without distinction as to race, sex, language, or religion, and to encourage recognition of the interdependence of the peoples of the world; and d. to ensure equal treatment in social, economic, and commercial matters for all Members of the United Nations and their nationals, and also equal treatment for the latter in the administration of justice, without prejudice to the attainment of the foregoing objectives and subject to the provisions of Article 80. Article 77 1. The trusteeship system shall apply to such territories in the following categories as may be placed thereunder by means of trusteeship agreements: a. territories now held under mandate; b. territories which may be detached from enemy states as a result of the Second World War; and c. territories voluntarily placed under the system by states responsible for their administration. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 46
    }
  },
  "152": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c47",
    "text": "territories voluntarily placed under the system by states responsible for their administration. 2. It will be a matter for subsequent agreement as to which territories in the foregoing categories will be brought under the trusteeship system and upon what terms. Article 78 The trusteeship system shall not apply to territories which have become Members of the United Nations, relationship among which shall be based on respect for the principle of sovereign equality. Article 79 The terms of trusteeship for each territory to be placed under the trusteeship system, including any alteration or amendment, shall be agreed upon by the states directly concerned, including the mandatory power in the case of territories held under mandate by a Member of the United Nations, and shall be approved as provided for in Articles 83 and 85. Article 80 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 47
    }
  },
  "153": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c48",
    "text": "Article 80 1. Except as may be agreed upon in individual trusteeship agreements, made under Articles 77, 79, and 81, placing each territory under the trusteeship system, and until such agreements have been concluded, nothing in this Chapter shall be construed in or of itself to alter in any manner the rights whatsoever of any states or any peoples or the terms of existing international instruments to which Members of the United Nations may respectively be parties. 2. Paragraph 1 of this Article shall not be interpreted as giving grounds for delay or postponement of the negotiation and conclusion of agreements for placing mandated and other territories under the trusteeship system as provided for in Article 77. Article 81 The trusteeship agreement shall in each case include the terms under which the trust territory will be administered and designate the authority which will exercise the administration of the trust territory",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 48
    }
  },
  "154": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c49",
    "text": "Such authority, hereinafter called the 15 administering authority, may be one or more states or the Organization itself. Article 82 , There may be designated, in any trusteeship agreement, a strategic area or areas which may include part or all of the trust territory to which the agreement applies, without prejudice to any special agreement or agreements made under Article 43. Article 83 1. All functions of the United Nations relating to strategic areas, including the approval of the terms of the trusteeship agreements and of their alteration or amendment, shall be exercised by the Security Council. 2. The basic objectives set forth in Article 76 shall be applicable to the people of each strategic area. 3",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 49
    }
  },
  "155": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c50",
    "text": "3. The Security Council shall, subject to the provisions of the trusteeship agreements and without prejudice to security considerations, avail itself of the assistance of the Trusteeship Council to perform those functions of the United Nations under the trusteeship system relating to political, economic, social, and educational matters in the strategic areas. Article 84 It shall be the duty of the administering authority to ensure that the trust territory shall play its part in the maintenance of international peace and security. To this end the administering authority may make use of volunteer forces, facilities, and assistance from the trust territory in carrying out the obligations towards the Security Council undertaken in this regard by the administering authority, as well as for local defense and the maintenance of law and order within the trust territory. Article 85 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 50
    }
  },
  "156": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c51",
    "text": "Article 85 1. The functions of the United Nations with regard to trusteeship agreements for all areas not designated as strategic, including the approval of the terms of the trusteeship agreements and of their alteration or amendment, shall be exercised by the General Assembly. 2. The Trusteeship Council, operating under the authority of the General Assembly, shall assist the General Assembly in carrying out these functions. CHAPTER XIII THE TRUSTEESHIP COUNCIL Composition Article 86 1. The Trusteeship Council shall consist of the following Members of the United Nations: a. those Members administering trust territories; b. such of those Members mentioned by name in Article 23 as are not administering trust territories; and c",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 51
    }
  },
  "157": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c52",
    "text": "as many other Members elected for threeyear terms by the General Assembly as may be necessary to ensure that the total number of members of the Trusteeship Council is equally divided between those Members of the United Nations which administer trust territories and those which do not. 2. Each member of the Trusteeship Council shall designate one specially qualified person to represent it therein. Functions and Powers Article 87 The General Assembly and, under its authority, the Trusteeship Council, in carrying out their functions, may: a. consider reports submitted by the administering authority; 16 b. accept petitions and examine them in consultation with the administering authority; c. provide for periodic visits to the respective trust territories at times agreed upon with the administering authority; and d. take these and other actions in conformity with the terms of the trusteeship agreements",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 52
    }
  },
  "158": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c53",
    "text": "take these and other actions in conformity with the terms of the trusteeship agreements. Article 88 The Trusteeship Council shall formulate a questionnaire on the political, economic, social, and educational advancement of the inhabitants of each trust territory, and the administering authority for each trust territory within the competence of the General Assembly shall make an annual report to the General Assembly upon the basis of such questionnaire. Voting Article 89 1. Each member of the Trusteeship Council shall have one vote. 2. Decisions of the Trusteeship Council shall be made by a majority of the members present and voting. Procedure Article 90 1. The Trusteeship Council shall adopt its own rules of procedure, including the method of selecting its President. 2. The Trusteeship Council shall meet as required in accordance with its rules, which shall include provision for the convening of meetings on the request of a majority of its members",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 53
    }
  },
  "159": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c54",
    "text": "Article 91 The Trusteeship Council shall, when appropriate, avail itself of the assistance of the Economic and Social Council and of the specialized agencies in regard to matters with which they are respectively concerned. CHAPTER XIV THE INTERNATIONAL COURT OF JUSTICE Article 92 The International Court of Justice shall be the principal judicial organ of the United Nations. It shall function in accordance with the annexed Statute, which is based upon the Statute of the Permanent Court of International Justice and forms an integral part of the present Charter. Article 93 1. All Members of the United Nations are ipso facto parties to the Statute of the International Court of Justice. 2. A state which is not a Member of the United Nations may become a party to the Statute of the International Court of Justice on conditions to be determined in each case by the General Assembly upon the recommendation of the Security Council. Article 94 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 54
    }
  },
  "160": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c55",
    "text": "Article 94 1. Each Member of the United Nations undertakes to comply with the decision of the International Court of Justice in any case to which it is a party. 2. If any party to a case fails to perform the obligations incumbent upon it under a judgment rendered by the Court, the other party may have recourse to the Security Council, which may, if it deems necessary, make recommendations or decide upon measures to be taken to give effect to the judgment. Article 95 Nothing in the present Charter shall prevent Members of the United Nations from entrusting the solution of their differences to other tribunals by virtue of agreements already in existence or which may be concluded in the future. 17 Article 96 1. The General Assembly or the Security Council may request the International Court of Justice to give an advisory opinion on any legal question. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 55
    }
  },
  "161": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c56",
    "text": "2. Other organs of the United Nations and specialized agencies, which may at any time be so authorized by the General Assembly, may also request advisory opinions of the Court on legal questions arising within the scope of their activities. CHAPTER XV THE SECRETARIAT Article 97 The Secretariat shall comprise a SecretaryGeneral and such staff as the Organization may require. The Secretary-General shall be appointed by the General Assembly upon the recommendation of the Security Council. He shall be the chief administrative officer of the Organization. Article 98 The Secretary-General shall act in that capacity in all meetings of the General Assembly, of the Security Council, of the Economic and Social Council, and of the Trusteeship Council, and shall perform such other functions as are entrusted to him by these organs. The Secretary-General shall make an annual report to the General Assembly on the work of the Organization",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 56
    }
  },
  "162": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c57",
    "text": "Article 99 The Secretary-General may bring to the attention of the Security Council any matter which in his opinion may threaten the maintenance of international peace and security. Article 100 1. In the performance of their duties the Secre18 tary-General and the staff shall not seek or receive instructions from any government or from any other authority external to the Organization. They shall refrain from any action which might reflect on their position as international officials responsible only to the Organization. 2. Each Member of the United Nations undertakes to respect the exclusively international character of the responsibilities of the SecretaryGeneral and the staff and not to seek to influence them in the discharge of their responsibilities. Article 101 1. The staff shall be appointed by the Secretary-General under regulations established by the General Assembly. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 57
    }
  },
  "163": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c58",
    "text": "2. Appropriate staffs shall be permanently assigned to the Economic and Social Council, the Trusteeship Council, and, as required, to other organs of the United Nations. These staffs shall form a part of the Secretariat. 3. The paramount consideration in the employment of the staff and in the determination of the conditions of service shall be the necessity of securing the highest standards of efficiency, competence, and integrity. Due regard shall be paid to the importance of recruiting the staff on as wide a geographical basis as possible. CHAPTER XVI MISCELLANEOUS PROVISIONS Article 102 1. Every treaty and every international agreement entered into by any Member of the United Nations after the present Charter comes into force shall as soon as possible be registered with the Secretariat and published by it. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 58
    }
  },
  "164": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c59",
    "text": "2. No party to any such treaty or international agreement which has not been registered in accordance with the provisions of paragraph 1 of this Article may invoke that treaty or agreement before any organ of the United Nations. Article 103 In the event of a conflict between the obligations of the Members of the United Nations under the present Charter and their obligations under any other international agreement, their obligations under the present Charter shall prevail. Article 104 The Organization shall enjoy in the territory of each of its Members such legal capacity as may be necessary for the exercise of its functions and the fulfillment of its purposes. Article 105 1. The Organization shall enjoy in the territory of each of its Members such privileges and immunities as are necessary for the fulfillment of its purposes. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 59
    }
  },
  "165": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c60",
    "text": "2. Representatives of the Members of the United Nations and officials of the Organization shall similarly enjoy such privileges and immunities as are necessary for the independent exercise of their functions in connection with the Organization. 3. The General Assembly may make recommendations with a view to determining the details of the application of paragraphs 1 and 2 of this Airticle or may propose conventions to the Members of the United Nations for this purpose",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 60
    }
  },
  "166": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c61",
    "text": "CHAPTER XVH TRANSITIONAL SECURITY ARRANGEMENTS Article 106 Pending the coming into force of such special agreements referred to in Article 43 as in the opinion of the Security Council enable it to begin the exercise of its responsibilities under Article 42, the parties to the Four-Nation Declaration, signed at Moscow, October 30,1943, and France, shall, in accordance with the provisions of paragraph 5 of that Declaration, consult with one another and as occasion requires with other Members of the United Nations with a view to such joint action on behalf of the Organization as may be necessary for the purpose of maintaining international peace and security. Article 107 Nothing in the present Charter shall invalidate or preclude action, in relation to any state which during the Second World War has been an enemy of any signatory to the present Charter, taken or authorized as a result of that war by the Governments having responsibility for such action",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 61
    }
  },
  "167": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c62",
    "text": "CHAPTER XVIII AMENDMENTS Article 108 Amendments to the present Charter shall come into force for all Members of the United Nations when they have been adopted by a vote of two thirds of the members of the General Assembly and ratified in accordance with their respective constitutional processes by two thirds of the Members of the United Nations, including all the permanent members of the Security Council. Article 109 1. A General Conference of the Members of the United Nations for the purpose of reviewing the present Charter may be held at a date and place to be fixed by a two-thirds vote of the members of the General Assembly and by a vote of any seven members of the Security Council. Each Member of the United Nations shall have one vote in the conference. 19 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 62
    }
  },
  "168": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c63",
    "text": "Each Member of the United Nations shall have one vote in the conference. 19 2. Any alteration of the present Charter recommended by a two-thirds vote of the conference shall take effect when ratified in accordance with their respective constitutional processes by two thirds of the Members of the United Nations including all the permanent members of the Security Council. 3. If such a conference has not been held before the tenth annual session of the General Assembly following the coming into force of the present Charter, the proposal to call such a conference shall be placed on the agenda of that session of the General Assembly, and the conference shall be held if so decided by a majority vote of the members of the General Assembly and by a vote of any seven members of the Security Council. CHAPTER XIX RATIFICATION AND SIGNATURE Article 110 1. The present Charter shall be ratified by the signatory states in accordance with their respective constitutional processes. / 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 63
    }
  },
  "169": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c64",
    "text": "/ 2. The ratifications shall be deposited with the Government of the United States of America, which shall notify all the signatory states of each deposit as well as the Secretary-General of the Organization when he has been appointed. 3. The present Charter shall come into force upon the deposit of ratifications by the Republic of China, France, the Union of Soviet Socialist Republics, the United Kingdom of Great Britain and Northern Ireland, and the United States of America, and by a majority of the other signatory states. A protocol of the ratifications deposited shall thereupon be drawn up by the Government of the United States of America which shall communicate copies thereof to all the signatory states. 4. The states signatory to the present Charter which ratify it after it has come into force will become original Members of the United Nations on the date of the deposit of their respective ratifications",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 64
    }
  },
  "170": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c65",
    "text": "Article HI The present Charter, of which the Chinese, French, Russian, English, and Spanish texts are equally authentic, shall remain deposited in the archives of the Government of the United States of America. Duly certified copies thereof shall be transmitted by that Government to the Governments of the other signatory states. IN FAITH WHEREOF the representatives of the Governments of the United Nations have signed the present Charter. DONE at the city of San Francisco the twentysixth day of June, one thousand nine hundred and forty-five. 20 STATUTE OF THE INTERNATIONAL COURT OF JUSTICE Article 1 INTERNATIONAL COURT OF JUSTICE established by the Charter of the United Nations as the principal judicial organ of the United Nations shall be constituted and shall function in accordance with the provisions of the present Statute",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 65
    }
  },
  "171": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c66",
    "text": "CHAPTER I ORGANIZATION OF THE COURT Article 2 The Court shall be composed of a body of independent judges, elected regardless of their nationality from among persons of high moral character, who possess the qualifications required in their respective countries for appointment to the highest judicial offices, or are jurisconsults of recognized competence in international law. Article 3 1. The Court shall consist of fifteen members, no two of whom may be nationals of the same state. 2, A person who for the purposes of membership in the Court could be regarded as a national of more than one state shall be deemed to be a national of the one in which he ordinarily exercises civil and political rights. Article 4 1. The members of the Court shall be elected by the General Assembly and by the Security Council from a list of persons nominated by the national groups in the Permanent Court of Arbitration, in accordance with the following provisions. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 66
    }
  },
  "172": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c67",
    "text": "2. In the case of Members of the United Nations not represented in the Permanent Court of Arbitration, candidates shall be nominated by national groups appointed for this purpose by their governments under the same conditions as those prescribed for members of the Permanent Courkof Arbitration by Article 44 of the Convention of The Hague of 1907 for the pacific settlement of international disputes. 3. The conditions under which a state which is a party to the present Statute but is not a Member of the United Nations may participate in electing the members of the Court shall, in the absence of a special agreement, be laid down by the General Assembly upon recommendation of the Security Council. Article 5 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 67
    }
  },
  "173": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c68",
    "text": "Article 5 1. At least three months before the date of the election, the Secretary-General of the United Nations shall address a written request to the members of the Permanent Court of Arbitration belonging to the states which are parties to the present Statute, and to the members of the national groups appointed under Article 4, paragraph 2, inviting them to undertake, within a given time, by national groups, the nomination of persons in a position to accept the duties of a member of the Court. 2. No group may nominate more than four persons, not more than two of whom shall be of their own nationality. In no case may the number of candidates nominated by a group be more than double the number of seats to be filled. Article 6 Before making these nominations, each national group is recommended to consult its highest court of justice, its legal faculties and schools of law, and its national academies and national sections of international academies devoted to the study of law",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 68
    }
  },
  "174": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c69",
    "text": "Article 7 1. The Secretary-General shall prepare a list 21 in alphabetical order of all the persons thus nominated. Save as provided in Article 12, paragraph 2, these shall be the only persons eligible. 2. The Secretary-General shall submit this list to the General Assembly and to the Security Council. Article 8 The General Assembly and the Security Council shall proceed independently of one another to elect the members of the Court. Article 9 At every election, the electors shall bear in mind not only that the persons to be elected should individually possess the qualifications required, but also that in the body as a whole the representation of the main forms of civilization and of the principal legal systems of the world should be assured. Article 10 1. Those candidates who obtain an absolute majority of votes in the General Assembly and in the Security Council shall be considered as elected. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 69
    }
  },
  "175": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c70",
    "text": "2. Any vote of the Security Council, whether for the election of judges or for the appointment of members of the conference envisaged in Article 12, shall be taken without any distinction between permanent and non-permanent members of the Security Council. 3. In the event of more than one national of the same state obtaining an absolute majority of the votes both of the General Assembly and of the Security Council, the eldest of these only shall be considered as elected. Article 11 If, after the first meeting held for the purpose of the election, one or more seats remain to be filled, a second and, if necessary, a third meeting shall take place. Article 12 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 70
    }
  },
  "176": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c71",
    "text": "Article 12 1. If, after the third meeting, one or more seats still remain unfilled, a joint conference consisting of six members, three appointed by the General Assembly and three by the Security Council, may be formed at any time at the request of either the General Assembly or the Security Council, for the purpose of choosing by the vote of an absolute majority one name for each seat still vacant, to submit to the General Assembly and the Security Council for their respective acceptance. 2. If the joint conference is unanimously agreed upon any person who fulfils the required conditions, he maybe included in its list, even though he was not included in the list of nominations referred to in Article 7. 3",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 71
    }
  },
  "177": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c72",
    "text": "3. If the joint conference is satisfied that it will not be successful in procuring an election, those members of the Court who have already been elected shall, within a period to be fixed by the Security Council, proceed to fill the vacant seats by selection from among those candidates who have obtained votes either in the General Assembly or in the Security Council. 4. In the event of an equality of votes among the judges, the eldest judge shall have a casting vote. Article 13 1. The members of the Court shall be elected for nine years and may be re-elected; provided, however, that of the judges elected at the first election, the terms of five judges shall expire at the end of three years and the terms of five more judges shall expire at the end of six years. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 72
    }
  },
  "178": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c73",
    "text": "2. The judges whose terms are to expire at the end of the above-mentioned initial periods of three and six years shall be chosen by lot to be drawn by the Secretary-General immediately after the first election has been completed. 3. The members of the Court shall continue to 22 discharge their duties until their places have been filled. Though replaced, they shall finish any cases which they may have begun. 4. In the case of the resignation of a member of the Court, the resignation shall be addressed to the President of the Court for transmission to the Secretary-General. This last notification makes the place vacant. Article 14 Vacancies shall be filled by the same method as that laid down for the first election, subject to the following provision : the Secretary-General shall, within one month of the occurrence of the vacancy, proceed to issue the invitations provided for in Article 5, and the date of the election shall be fixed by the Security Council",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 73
    }
  },
  "179": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c74",
    "text": "Article 15 A member of the Court elected to replace a member whose term of office has not expired shall hold office for the remainder of his predecessor's term. Article 16 1. No member of the Court may exercise any political or administrative function, or engage in any other occupation of a professional nature. 2. Any doubt on this point shall be settled by the decision of the Court. Article 17 1. No member of the Court may act as agent, counsel, or advocate in any case. 2. No member may participate in the decision of any case in which he has previously taken part as agent, counsel, or advocate for one of the parties, or as a member of a national or international court, or of a commission of enquiry, or in any other capacity. 3. Any doubt on this point shall be settled by the decision of the Court. Article 18 1. No member of the Court can be dismissed unless, in the unanimous opinion of the other members, he has ceased to fulfil the required conditions. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 74
    }
  },
  "180": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c75",
    "text": "2. Formal notification thereof shall be made to the Secretary-General by the Registrar. 3. This notification makes the place vacant. Article 19 The members of the Court, when engaged on the business of the Court, shall enjoy diplomatic privileges and immunities. Article 20 Every member of the Court shall, before taking up his duties, make a solemn declaration in open court that he will exercise his powers impartially and conscientiously. Article 21 1. The Court shall elect its President and VicePresident for three years; they may be re-elected. 2. The Court shall appoint its Registrar and may provide for the appointment of such other officers as may be necessary. Article 22 1. The seat of the Court shall be established at The Hague. This, however, shall not prevent the Court from sitting and exercising its functions elsewhere whenever the Court considers it desirable. 2. The President and the Registrar shall reside at the seat of the Court. Article 23 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 75
    }
  },
  "181": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c76",
    "text": "2. The President and the Registrar shall reside at the seat of the Court. Article 23 1. The Court shall remain permanently in session, except during the judicial vacations, the dates and duration of which shall be fixed by the Court. 2. Members of the Court are entitled to peri23 odic leave, the dates and duration of which shall be fixed by the Court, having in mind the distance between The Hague and the home of each judge. 3. Members of the Court shall be bound, unless they are on leave or prevented from attending \" by illness or other serious reasons duly explained to the President, to hold themselves permanently at the disposal of the Court. Article 24 1. If, for some special reason, a member of the Court considers that he should not take part in the decision of a particular case, he shall so inform the President. 2. If the President considers that for some special reason one of the members of the Court should not sit in a particular case, he shall give him notice accordingly. 3",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 76
    }
  },
  "182": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c77",
    "text": "3. If in any such case the member of the Court and the President disagree, the matter shall be settled by the decision of the Court. Article 25 1. The full Court shall sit except when it is expressly provided otherwise in the present Statute. 2. Subject to the condition that the number of judges available to constitute the Court is not thereby reduced below eleven, the Rules of the Court may provide for allowing one or more judges, according to circumstances and in rotation, to be dispensed from sitting. 3. A quorum of nine judges shall suffice to constitute the Court. Article 26 1. The Court may from time to time form one or more chambers, composed of three or more judges as the Court may determine, for dealing with particular categories of cases; for example, labor cases and cases relating to transit and communications. 2. The Court may at any time form a chamber for dealing with a particular case",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 77
    }
  },
  "183": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c78",
    "text": "2. The Court may at any time form a chamber for dealing with a particular case. The number of judges to constitute such a chamber shall be determined by the Court with the approval of the parties. 3. Cases shall be heard and determined by the chambers provided for in this Article if the parties so request. Article 27 A judgment given by any of the chambers provided for in Articles 26 and 29 shall be considered as rendered by the Court. Article 28 The chambers provided for in Articles 26 and 29 may, with the consent of the parties, sit and exercise their functions elsewhere than at The Hague. Article 29 With a view to the speedy despatch of business, the Court shall form annually a chamber composed of five judges which, at the request of the parties, may hear and determine cases by summary procedure. In addition, two judges shall be selected for the purpose of replacing judges who find it impossible to sit. Article 30 1. The Court shall frame rules for carrying ou t its functions",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 78
    }
  },
  "184": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c79",
    "text": "Article 30 1. The Court shall frame rules for carrying ou t its functions. In particular, it shall lay down rules of procedure. 2. The Rules of the Court may provide for assessors to sit with the Court or with any of its chambers, without the right to vote. Article 31 1. Judges of the nationality of each of the parties shall retain their right to sit in the case before the Court. 2. If the Court includes upon the Bench a judge of the nationality of one of the parties, any other party may choose a person to sit as judge. Such person shall be chosen preferably from among 24 those persons who have been nominated as candidates as provided in Articles 4 and 5. 3. If the Court includes upon the Bench no judge of the nationality of the parties, each of these parties may proceed to choose a judge as provided in paragraph 2 of this Article. 4. The provisions of this Article shall apply to the case of Articles 26 and 29",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 79
    }
  },
  "185": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c80",
    "text": "4. The provisions of this Article shall apply to the case of Articles 26 and 29. In such cases, the President shall request one or, if necessary, two of the members of the Court forming the chamber to give place to the members of the Court of the nationality of the parties concerned, and, failing such, or if they are unable to be present, to the judges specially chosen by the parties. 5. Should there be several parties in the same interest, they shall, for the purpose of the preceding provisions, be reckoned as one party only. Any doubt upon this point shall be settled by the decision of the Court. 6. Judges chosen as laid down in paragraphs 2,3, and 4 of this Article shall fulfil the conditions required by Articles 2,17 (paragraph 2), 20, and 24 of the present Statute. They shall take part in the decision on terms of complete equality with their colleagues. Article 32 1. Each member of the Court shall receive an annual salary. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 80
    }
  },
  "186": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c81",
    "text": "Article 32 1. Each member of the Court shall receive an annual salary. 2. The President shall receive a special annual allowance. 3. The Vice-President shall receive a special allowance for every day on which he acts as President. 4. The judges chosen under Article 31, other than members of the Court, shall receive compensation for each^day on which they exercise their functions. 5. These salaries, allowances, and compensation shall be fixed by the General Assembly. They may not be decreased during the term of office. 6. The salary of the Registrar shall be fixed by the General Assembly on the proposal of the Court. 7. Regulations made by the General Assembly shall fix the conditions under which retirement pensions may be given to members of the Court and to the Registrar, and the conditions under which members of the Court and the Registrar shall have their traveling expenses refunded. 8. The above salaries, allowances, and compensation shall be free of all taxation",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 81
    }
  },
  "187": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c82",
    "text": "8. The above salaries, allowances, and compensation shall be free of all taxation. Article 33 The expenses of the Court shall be borne by the United Nations in such a manner as shall be decided by the General Assembly. CHAPTER II COMPETENCE OF THE COURT Article 34 1. Only states may be parties in cases before the Court. 2. The Court, subject to and in conformity with its Rules, may request of public international organizations information relevant to cases before it, and shall receive such information presented by such organizations on their own initiative. 3. Whenever the construction of the constituent instrument of a public international organization or of an international convention adopted thereunder is in question in a case before the Court, the Registrar shall so notify the public international organization concerned and shall communicate to it copies of all the written proceedings. Article 35 1. The Court shall be open to the states parties to the present Statute. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 82
    }
  },
  "188": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c83",
    "text": "Article 35 1. The Court shall be open to the states parties to the present Statute. 2. The conditions under which the Court shall be open to other states shall, subject to the special provisions contained in treaties in force, be laid 25 down by the Security Council, but in no case shall such conditions place the parties in a position of inequality before the Court. 3. When a state which is not a Member of the United Nations is a party to a case, the Court shall fix the amount which that party is to contribute towards the expenses of the Court. This provision shall not apply if such state is bearing a share of the expenses of the Court. Article 36 1. The jurisdiction of the Court comprises all cases which the parties refer to it and all matters specially provided for in the Charter of the United Nations or in treaties and conventions in force. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 83
    }
  },
  "189": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c84",
    "text": "2. The states parties to the present Statute may at any time declare that they recognize as compulsory ipso facto and without special agreement, in relation to any other state accepting the same obligation, the jurisdiction of the Court in all legal disputes concerning: a. the interpretation of a treaty; b. any question of international law; c. the existence of any fact which, if established, would constitute a breach of an international obligation ; d. the nature or extent of the reparation to be made for the breach of an international obligation. 3. The declarations referred to above may be made unconditionally or on condition of reciprocity on the part of several or certain states, or for a certain time. 4. Such declarations shall be deposited with the Secretary-General of the United Nations, who shall transmit copies thereof to the parties to the Statute and to the Registrar of the Court. 5",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 84
    }
  },
  "190": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c85",
    "text": "5. Declarations made under Article 36 of the Statute of the Permanent Court of International Justice and which are still in force shall be deemed, as between the parties to the present Statute, to be acceptances of the compulsory jurisdiction of the International Court of Justice for the period which they still have to run and in accordance with their terms. 6. In the event of a dispute as to whether the Court has jurisdiction, the matter shall be settled by the decision of the Court. Article 37 Whenever a treaty or convention in force provides for reference of a matter to a tribunal to have been instituted by the League of Nations, or to the Permanent Court of International Justice, the matter shall, as between the parties to the present Statute, be referred to the International Court of Justice. Article 38 1. The Court, whose function is to decide in accordance with international law such disputes as are submitted to it, shall apply: a",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 85
    }
  },
  "191": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c86",
    "text": "international conventions, whether general or particular, establishing rules expressly recognized by the contesting states ; b. international custom, as evidence of a general practice accepted as law; c. the general principles of law recognized by civilized nations ; d. subject to the provisions of Article 59, judicial decisions and the teachings of the most highly qualified publicists of the various nations, as subsidiary means for the determination of rules of law. 2. This provision shall not prejudice the power of the Court to decide a case ex aequo et bond, if the parties agree thereto. CHAPTER III PROCEDURE Article 39 1. The official languages of the Court shall be French and English. If the parties agree that the 26 case shall be conducted in French, the judgment shall be delivered in French. If the parties agree that the case shall be conducted in English, the judgment shall be delivered in English. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 86
    }
  },
  "192": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c87",
    "text": "2. In the absence of an agreement as to which language shall be employed, each party may, in the pleadings, use the language which it prefers; the decision of the Court shall be given in French and English. In this case the Court shall at the same time determine which of the two texts shall be considered as authoritative. 3. The Court shall, at the request of any party, authorize a language other than French or English to be used by that party. Article 40 1. Cases are brought before the Court, as the case may be, either by the notification of the special agreement or by a written application addressed to the Registrar. In either case the subject of the dispute and the parties shall be indicated. 2. The Registrar shall forthwith communicate the application to all concerned. 3. He shall also notify the Members of the United Nations through the Secretary-General, and also any other states entitled to appear before the Court. Article 41 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 87
    }
  },
  "193": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c88",
    "text": "Article 41 1. The Court shall have the power to indicate, if it considers that circumstances so require, any provisional measures which ought to be taken to preserve the respective rights of either party. 2. Pending the final decision, notice of the measures suggested shall forthwith be given to the parties and to the Security Council. Article 42 1. The parties shall be represented by agents. 2. They may have the assistance of counsel or advocates before the Court. 3. The agents, counsel, and advocates of parties before the Court shall enjoy the privileges and immunities necessary to the independent exercise of their duties. Article 43 1. The procedure shall consist of two parts: written and oral. 2. The written proceedings shall consist of the communication to the Court and to the parties of memorials, counter-memorials and, if necessary, replies; also all papers and documents in support. 3",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 88
    }
  },
  "194": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c89",
    "text": "3. These communications shall be made through the Registrar, in the order and within the time fixed by the Court. 4. A certified copy of every document produced by one party shall be communicated to the other party. 5. The oral proceedings shall consist of the hearing by the Court of witnesses, experts, agents, counsel, and advocates. Article 44 1. For the service of all notices upon persons other than the agents, counsel, and advocates, the Court shall apply direct to the government of the state upon whose territory the notice has to be served. 2. The same provision shall apply whenever steps are to be taken to procure evidence on the spot. Article 45 The hearing shall be under the control of the President or, if he is unable to preside, of the VicePresident; if neither is able to preside, the senior judge present shall preside. Article 46 The hearing in Court shall be public, unless the Court shall decide otherwise, or unless the parties demand that the public be not admitted",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 89
    }
  },
  "195": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c90",
    "text": "27 Article 47 1. Minutes shall be made at each hearing and signed by the Registrar and the President. 2. These minutes alone shall be authentic. Article 48 The Court shall make orders for the conduct of the case, shall decide the form and time in which each party must conclude its arguments, and make all arrangements connected with the taking of evidence. Article 49 The Court may, even before the hearing begins, call upon the agents to produce any document or to supply any explanations. Formal note shall be taken of any refusal. Article 50 The Court may, at any time, entrust any individual, body, bureau, commission, or other organization that it may select, with the task of carrying out an enquiry or giving an expert opinion. Article 51 During the hearing any relevant questions are to be put to the witnesses and experts under the conditions laid down by the Court in the rules of procedure referred to in Article 30",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 90
    }
  },
  "196": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c91",
    "text": "Article 52 After the Court has received the proofs and evidence within the time specified for the purpose, it may refuse to accept any further oral or written evidence that one party may desire to present unless the other side consents. Article 53 1. Whenever one of the parties does not appear before the Court, or fails to defend its case, the other party may call upon the Court to decide in favor of its claim. 2. The Court must, before doing so, satisfy itself, not only that it has jurisdiction in accordance with Articles 36 and 37, but also that the claim is well founded in fact and law. Article 54 1. When, subject to the control of the Court, the agents, counsel, and advocates have completed their presentation of the case, the President shall declare the hearing closed. 2. The Court shall withdraw to consider the judgment. 3. The deliberations of the Court shall take place in private and remain secret. Article 55 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 91
    }
  },
  "197": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c92",
    "text": "3. The deliberations of the Court shall take place in private and remain secret. Article 55 1. All questions shall be decided by a maj ority of the judges present. 2. In the event of an equality of votes, the President or the judge who acts in his place shall have a casting vote. Article 56 1. The judgment shall state the reasons on which it is based. 2. It shall contain the names of the judges who have taken part in the decision. Article 57 If the judgment does not represent in whole or in part the unanimous opinion of the judges, any judge shall be entitled to deliver a separate opinion. Article 58 The judgment shall be signed by the President and by the Registrar. It shall be read in open court, due notice having heen given to the agents. Article 59 The decision of the Court has no binding force except between the parties and in respect of that particular case. 28 Article 60 The judgment is final and without appeal",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 92
    }
  },
  "198": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c93",
    "text": "28 Article 60 The judgment is final and without appeal. In the event of dispute as to the meaning or scope of the judgment, the Court shall construe it upon the request of any party. Article 61 1. An application for revision of a judgment may be made only when it is based upon the discovery of some fact of such a nature as to be a decisive factor, which fact was, when the judgment was given, unknown to the Court and also to the party claiming revision, always provided that such ignorance was not due to negligence. 2. The proceedings for revision shall be opened by a judgment of the Court expressly recording the existence of the new fact, recognizing that it has such a character as to lay the case open to revision, and declaring the application admissible on this ground. 3. The Court may require previous compliance with the terms of the judgment before it admits proceedings in revision. 4",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 93
    }
  },
  "199": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c94",
    "text": "4. The application for revision must be made at latest within six months of the discovery of the new fact. 5. No application for revision may be made after the lapse of ten years from the date of the judgment. Article 62 1. Should a state consider that it has an interest of a legal nature which may be affected by the decision in the case, it may submit a request to the Court to be permitted to intervene. 2. It shall be for the Court to decide upon this request. Article 63 1. Whenever the construction of a convention to which states other than those concerned in the case are parties is in question, the Registrar shall notify all such states forthwith. 2. Every state so notified has the right to intervene in the proceedings; but if it uses this right, the construction given by the judgment will be equally binding upon it. Article 64 Unless otherwise decided by the Court, each party shall bear its own costs. CHAPTER IV ADVISORY OPINIONS Article 65 1",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 94
    }
  },
  "200": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c95",
    "text": "CHAPTER IV ADVISORY OPINIONS Article 65 1. The Court may give an advisory opinion on any legal question at the request of whatever body may be authorized by or in accordance with the Charter of the United Nations to make such a request. 2. Questions upon which the advisory opinion of the Court is asked shall be laid before the Court by means of a written request containing an exact statement of the question upon which an opinion is required, and accompanied by all documents likely to throw light upon the question. Article 66 1. The Registrar shall forthwith give notice of the request for an advisory opinion to all states entitled to appear before the Court. 2",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 95
    }
  },
  "201": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c96",
    "text": "2. The Registrar shall also, by means of a special and direct communication, notify any state entitled to appear before the Court or international organization considered by the Court, or, should it not be sitting, by the President, as likely to be able to furnish information on the question, that the Court will be prepared to receive, within a time limit to be fixed by the President, written statements, or to hear, at a public sitting to be held for the purpose, oral statements relating to the question. 29 3. Should any such state entitled to appear before the Court have failed to receive the special communication referred to in paragraph 2 of this Article, such state may express a desire to submit a written statement or to be heard; and the Court will decide. 4",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 96
    }
  },
  "202": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c97",
    "text": "4. States and organizations having presented written or oral statements or both shall be permitted to comment on the statements made brother states or organizations in the form, to the extent, and within the time limits which the Court, or, should it not be sitting, the President, shall decide in each particular case. Accordingly, the Registrar shall in due time communicate any such written statements to states and organizations having submitted similar statements. Article 67 The Court shall deliver its advisory opinions in open court, notice having been given to the Secretary-General and to the representatives of Members of the United Nations, of other states and of international organizations immediately concerned. Article 68 In the exercise of its advisory functions the Court shall further be guided by the provisions of the present Statute which apply in contentious cases to the extent to which it recognizes them to be applicable",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 97
    }
  },
  "203": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c98",
    "text": "CHAPTERV AMENDMENT Article 69 Amendments to the present Statute shall be effected by the same procedure as is provided by the Charter of the United Nations for amendments to that Charter, subject however to any provisions which the General Assembly upon recommendation of the Security Council may adopt concerning the participation of states which are parties to the present Statute but are not Members of the United Nations. Article 70 The Court shall have power to propose such amendments to the present Statute as it may deem necessary, through written communications to the Secretary-General, for consideration in conformity with the provisions of Article 69",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 98
    }
  },
  "204": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c99",
    "text": "30 FOR CHINA: POUR LA CHINE: 3a Kirran: POR LA CHINA: T $ FOR THE UNION OF SOVIET SOCIALIST REPUBLICS: POUR L'UNION DES REPUBLIQUES SOVIETIQUES SOCIALISTES: 3a C0103 COBETCKIIX ComiajiHcnraecKiix Pecnyojimc: POR LA UNION DE REPUBLICAS SOCIALISTAS SOVIETICAS: (H^tMh-—\" FOR THE UNITED KINGDOM OF GREAT BRITAIN AND NORTHERN IRELAND: POUR LE ROYAUME-UNI DE GRANDE-BRETAGNE ET D'IRLANDE DU NORD : 3a Coe^HHeHHoe KopojieBCTBO BejiHEoftpHTamninCeBepHOHH H Ce POR EL REINO UNIDO DE LA GRAN BRETANA E IRLANDA DEL NORTE: FOR THE UNITED STATES OF AMERICA POUR LES ETATS-UNIS D'AMERIQUE: 3a CoeflimeHHBie IHraTH POR LOS ESTAD \"7\" \\L ^A FOR FRANCE: POUR LA FRANCE 3a POR FRANCIA: FOR ARGENTINA: POUR L'ARGENTINE : 3a ApreHTHHy: POR LA ARGENTINA FOR AUSTRALIA: POUR L'AUSTRALIE 3a POR AUSTRAL FOR THE KINGDOM OF BELGIUM: POUR LE ROYAUME DE BELGIQUE : 3a Kopo.ieBCTBo Bejitran: POR EL REINO DE BELGICA: FOR BOLIVIA: POUR LA BOLIVIE 3a BojniBiiio: POR BOLIVIA: FOR BRAZIL: POUR LE BRESIL: 3a Bpa3iiJiino: POR EL",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 99
    }
  },
  "205": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c100",
    "text": "BELGICA: FOR BOLIVIA: POUR LA BOLIVIE 3a BojniBiiio: POR BOLIVIA: FOR BRAZIL: POUR LE BRESIL: 3a Bpa3iiJiino: POR EL BRASIL: 'C-<--i»_-»—•—• \\j FOR THE BYELORUSSIAN SOVIET SOCIALIST REPUBLIC : POUR LA REPUBLIQUE SOVIETIQUE SOCIALISTE DEBELORUSSIE 3a BejiopyccKyio CoeeTCKyio CounajincTinecKyio Pecny6jiHKy: POR LA REPUBLICA SOCIALISTA SOVIETICA BIELORRUSA: FOR CANADA: POUR LE CANADA 3a POR EL CANADA: FOR CHILE: POUR LE CHILI: 3a POR CHILE; (^J^VY //l *^ FOR COLOMBIA: POUR LA COLOMBIE Ff 5 * 1 3a POR COLOMBIA: FOR COSTA RICA: POUR COSTA-RICA 3a KocTapmcy: POR COSTA RICA: FOR CUBA: POUR CUBA 3a Kyoy: POR CUBA: FOR CZECHOSLOVAKIA: POUR LA TCHECOSLOVAQUIE 3a lIexocjioBaKHH): POR CHECOESLOVAQUIA: FOR DENMARK: POUR LE DANEMARK 3a J POR DINAMARCA: FOR THE DOMINICAN REPUBLIC: POUR LA REPUBLIQUE DOMINICAINE: 3a /JoMEHHKaHCKyio Pec POR LA REPUBLIC A FOR ECUADOR: POUR L'EQUATEUR 3a POR EL ECUADOR: FOR EGYPT: POUR L'EGYPTE: ^A^K^J^ilíL 3a POR EGIPTO: FOR EL SALVADOR: POUR LE SALVADOR 3a POR EL",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 100
    }
  },
  "206": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c101",
    "text": "3a POR EL ECUADOR: FOR EGYPT: POUR L'EGYPTE: ^A^K^J^ilíL 3a POR EGIPTO: FOR EL SALVADOR: POUR LE SALVADOR 3a POR EL SALVADOR: r FOR ETHIOPIA: POUR L'ETHIOPIE 3a POR ETIOPIA: FOR GREECE: POUR LA GRECE: 3a rpemiio: POR GRECIA: / FOR GUATEMALA: POUR LE GUATEMALA JBUU& 3a FBaTeMajiy: POR GUATEMALA FOR HAITI: POUR HAITI: 3a POR HAITI : FOR HONDURAS: POUR LE HONDURAS: 3a FoHflypac: POR HONDURAS: FOR INDIA: POUR L'INDE: 3a HH,¡JHIO: POR LA INDIA: FOR IRAN: POUR L'IRAN: 3a Hpan: POR IRAN: FOR IRAQ: POUR L'IRAK: 3a Hpaie: POR IRAK: FOR LEBANON: POUR LE LIBAN 3a POR EL LIBANO FOR LIBERIA: POUR LE LIBERIA: 3a JTHÔepmo: POR LIBERIA FOR THE GRAND DUCHY OF LUXEMBOURG POUR LE GRAND DUCHE DE LUXEMBOURG 3a BejiHKoe FepuorcTBo JIroKceM6ypr: POR EL GRAN DUCADO DE LUXEMBURGO: FOR MEXICO : POUR LE MEXIQUE : 3a MeKcmcy: POR MEXICO: FOR THE KINGDOM OF THE NETHERLANDS POUR LE ROYAUME DES PAYS-BAS : 3a KopojieBCTBo POR EL REINO DE HOLANDA: FOR NEW ZEALAND: POUR LA NOUVELLE-ZELANDE: 3a HOBVK) 3ejiaHffHio: POR",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 101
    }
  },
  "207": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c102",
    "text": ": 3a KopojieBCTBo POR EL REINO DE HOLANDA: FOR NEW ZEALAND: POUR LA NOUVELLE-ZELANDE: 3a HOBVK) 3ejiaHffHio: POR NUEVA ZELANDIA: FOR NICARAGUA: POUR LE NICARAGUA: 3a HnKaparya: POR NICARAGUA: FOR THE KINGDOM OF NORWAY: POUR LE ROYAUME DE NORVÈGE: 3a KopojiescTBO HopBerm: POR EL REINO DE NORUEGA: FOR PANAMA: POUR LE PANAMA: 3a POR PANAMA: FOR PARAGUAY: POUR LE PARAGUAY 3a IlaparBaH: POR EL PARAGUAY: FOR PERU: POUR LE PEROU: 3a Ilepy: POR EL PERU: FOR.THE PHILIPPINE COMMONWEALTH: POUR LE COMMONWEALTH DES PHILIPPINES: 3a POR LA MANCOMUNIDAD DE FILIPINAS: / * / FOR POLAND: POUR LA POLOGNE 3a IIojiBiny: POR POLONIA: FOR SAUDI ARABIA: POUR L'ARABIE SAOUDITE 3a Cay#n ApaBHio: POR ARABIA SAUDITA: FOR SYRIA: POUR LA SYRIE: 3a Cnpnio: POR SIRIA: FOR TURKEY: POUR LA TURQUIE 3aTypupEDEo: POR TURQUIA: FOR THE UKRAINIAN SOVIET SOCIALIST REPUBLIC: POUR LA RÉPUBLIQUE SOVIÉTIQUE SOCIALISTE D'UKRAINE: 8a yKpaHHCKyio CoBeTCKyio Coi^iiajmcTn^ecKyio Pecnydjimcy: POR LA REPÚBLICA SOCIALISTA SOVIÉTICA",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 102
    }
  },
  "208": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c103",
    "text": "D'UKRAINE: 8a yKpaHHCKyio CoBeTCKyio Coi^iiajmcTn^ecKyio Pecnydjimcy: POR LA REPÚBLICA SOCIALISTA SOVIÉTICA UCRANIANA: J ut ^vwi/V(ro FOR THE UNION OF SOUTH AFRICA: POUR L'UNION SUD-AFRICAINE: 3a IOiKHoa^pmcaHCKiiH C0103: POR LA UNIÓN SUDAFRICANA: o FOR URUGUAY: POUR L'URUGUAY 3a POR EL URUGUAY FOR VENEZUELA: POUR LE VENEZUELA: 8a BeHecyaziy: POR VENEZUELA: FOR YUGOSLAVIA: POUR LA YOUGOSLAVIE 3a K)rocJiaBmo: POR YUGOSLAVIA: I Certify 1hat the foregoing is a true copy of the Charter of the United Nations, with the Statute of the International Court of Justice annexed thereto, signed in San Francisco, California, on June 26,1945, in the Chinese, French, Russian, English, and Spanish languages, the signed original of which is deposited in the archives of the Government of the United States of America",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 103
    }
  },
  "209": {
    "id": "b7b92f1c-c717-47ed-802f-7d2654b8975c_c104",
    "text": "In Testimony Whereof, I, EDWARD R. STETTINIUS, JR., Secretary of State, have hereunto caused the seal of the Department of State to be affixed and my name subscribed by an Assistant Chief, Division of Central Services of the said Department, at the city of Washington, in the District of Columbia, this twenty-qewwroilay of June1945. Se/ifeUiTyjof State Assistant Chief, Division of Central Services",
    "metadata": {
      "file_id": "b7b92f1c-c717-47ed-802f-7d2654b8975c",
      "chunk_index": 104
    }
  }
}